rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
/* Check if Adc_Ipw_Irq.c file and DSPSS_Api.h file are of the same Software version */
#if ((ADC_IPW_SW_MAJOR_VERSION_IRQ_C != DSPSS_SW_MAJOR_VERSION_API) || \
     (ADC_IPW_SW_MINOR_VERSION_IRQ_C != DSPSS_SW_MINOR_VERSION_API) || \
     (ADC_IPW_SW_PATCH_VERSION_IRQ_C != DSPSS_SW_PATCH_VERSION_API) \
    )
  #error "Software Version Numbers of Adc_Ipw_Irq.c and DSPSS_Api.h are different"
#endif

#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */
#endif /* (STD_ON == ADC_IPW_SDADC_IS_USED) */

/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL MACROS
==================================================================================================*/

/*==================================================================================================
*                                      LOCAL CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                      LOCAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                      GLOBAL CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/
#define ADC_START_SEC_CODE
#include "Adc_MemMap.h"

#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_INJECTED_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
     defined(ADC_ANY_UNIT_FIFOFULL_ISR_USED) || \
     defined(ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED) \
    )

#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_INJECTED_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
    ((ADC_HW_TRIGGER_API == STD_ON) && (defined(ADC_ANY_UNIT_BCTU_LIST_ISR_USED)) && (ADC_IPW_BCTU_AVAILABLE == STD_ON)) \
    )
static inline Std_ReturnType Adc_Ipw_RecordResult(Adc_HwUnitType Unit,
                                                  Adc_GroupType Group,
                                                  Adc_StreamNumSampleType GroupSamples,
                                                  uint8 UserId);
#endif /* defined(ADC_ANY_UNIT_NORMAL_ISR_USED) ||... */                                               
#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
     ((defined(ADC_ANY_UNIT_INJECTED_ISR_USED)) && (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON))  \
    ) 
static inline Adc_StreamNumSampleType Adc_Ipw_GetNumsCurrentSample(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                                   const Adc_GroupConfigurationType * const GroupPtr,
                                                                   boolean RuntimeChanUpdated);
#endif /* defined(ADC_ANY_UNIT_NORMAL_ISR_USED) ||... */

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
static inline boolean Adc_Ipw_CheckNotification(Adc_GroupType Group,
                                                uint8 UserId);
#endif /* ADC_GRP_NOTIF_CAPABILITY == STD_ON */
#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
     ((defined(ADC_ANY_UNIT_INJECTED_ISR_USED)) && (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)) || \
     defined(ADC_ANY_UNIT_FIFOFULL_ISR_USED) || \
     defined(ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED) \
    )
static inline void Adc_Ipw_UpdateQueue(Adc_HwUnitType Unit,
                                       uint8 UserId);
#endif /* defined(ADC_ANY_UNIT_NORMAL_ISR_USED) ||... */

#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
     ((defined(ADC_ANY_UNIT_INJECTED_ISR_USED)) && (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON))  \
    )   
static inline void Adc_Ipw_UpdateGroupState(Adc_HwUnitType Unit,
                                            Adc_GroupType Group,
                                            Adc_StreamNumSampleType GroupSamples,
                                            boolean InjectedFlag,
                                            uint8 UserId);
#ifdef ADC_DMA_SUPPORTED
static inline void Adc_Ipw_UpdateTcdDestAddr(const Adc_GroupConfigurationType * GroupPtr,
                                             const uint32 DmaLogicChannel);
static inline void Adc_Ipw_CheckAndEnableDmaHwRequest(const Adc_HwUnitType Unit,
                                                      const Adc_GroupConfigurationType * const GroupPtr,
                                                      const Adc_Ipw_Config * const AdcIpwConfigPtr);
static inline void Adc_Ipw_UpdateNextDestinationAddress(Adc_HwUnitType Unit,
                                                        const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                        const Adc_GroupConfigurationType * GroupPtr);
                                                      
#endif /*ADC_DMA_SUPPORTED*/                                                     
#endif /* defined(ADC_ANY_UNIT_NORMAL_ISR_USED) ||... */

#ifdef ADC_DMA_SUPPORTED
static inline void Adc_Ipw_EnableDmaHwRequest(Adc_HwUnitType Unit,
                                              const Adc_GroupConfigurationType * GroupPtr,
                                              const Adc_Ipw_Config * const AdcIpwConfigPtr);

#ifdef ADC_ANY_UNIT_DMA_TRANSFER_USED
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
static inline Std_ReturnType Adc_Ipw_CheckGroupConvResultDma(const Adc_GroupConfigurationType * GroupPtr,
                                                             uint32 AdcDmaLogicChId,
                                                             uint8 UserId);
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
#endif /* ADC_ANY_UNIT_DMA_TRANSFER_USED */
#if defined(ADC_DMA_ERROR_SUPPORTED)
static inline void Adc_Ipw_DMATransferErrorHandler(const Adc_HwUnitType PhysicalAdcUnit);
#endif /* ADC_DMA_ERROR_SUPPORTED*/

