rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
#endif /* ADC_DMA_SUPPORTED */
#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
     ((defined(ADC_ANY_UNIT_INJECTED_ISR_USED)) && (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)) \
    )
#if (ADC_SETCHANNEL_API == STD_ON)
static inline void Adc_Ipw_ConfigureRuntimeSoftwareGroup(const Adc_GroupConfigurationType * GroupPtr,
                                                         Adc_HwUnitType PhysicalHwUnitId,
                                                         boolean InjectedFlag,
                                                         uint8 UserId);
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

static inline void Adc_Ipw_EndSoftwareConv(Adc_HwUnitType Unit,
                                           boolean InjectedFlag,
                                           uint8 UserId);
#endif /* defined(ADC_ANY_UNIT_NORMAL_ISR_USED) ||... */

#if (ADC_HW_TRIGGER_API == STD_ON)
#if ( \
        ((defined(ADC_ANY_UNIT_NORMAL_ISR_USED)) && (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)) || \
        defined(ADC_ANY_UNIT_INJECTED_ISR_USED) || \
        defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
        ((defined(ADC_ANY_UNIT_BCTU_LIST_ISR_USED)) && (ADC_IPW_BCTU_AVAILABLE == STD_ON)) \
    )
#if (ADC_SETCHANNEL_API == STD_ON)
static inline Std_ReturnType Adc_Ipw_ConfigureRuntimeHardwareGroup(Adc_HwUnitType Unit,
                                                                   boolean InjectedFlag,
                                                                   uint8 UserId);
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
#ifdef ADC_DMA_SUPPORTED
static void Adc_Ipw_ResetResultPointer(const Adc_GroupConfigurationType * GroupPtr,
                                        const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                        uint32 AdcDmaLogicChId);
#endif /* ADC_DMA_SUPPORTED */

static inline void Adc_Ipw_DisableHwTriggerSrc(Adc_HwUnitType Unit,
                                               boolean InjectedFlag,
                                               Adc_HwTriggerTimerType TriggerSrc,
                                               uint8 UserId);
#endif /* ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF */

static inline void Adc_Ipw_EndHardwareConv(Adc_HwUnitType Unit,
                                           boolean InjectedFlag,
                                           uint8 UserId);
#endif /* (((defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || ... */
#endif /* ADC_HW_TRIGGER_API == STD_ON */

#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || defined(ADC_ANY_UNIT_DMA_TRANSFER_USED))
static inline void Adc_Ipw_EndNormalChainNotification(const Adc_HwUnitType PhysicalAdcUnit);
#endif /* (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) */

#if (defined(ADC_ANY_UNIT_INJECTED_ISR_USED) || defined(ADC_ANY_UNIT_DMA_TRANSFER_USED))
static inline void Adc_Ipw_EndInjectedChainNotification(const Adc_HwUnitType PhysicalAdcUnit);
#endif /* (defined(ADC_ANY_UNIT_INJECTED_ISR_USED) || ... */

#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_INJECTED_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
    ((ADC_HW_TRIGGER_API == STD_ON) && (defined(ADC_ANY_UNIT_BCTU_LIST_ISR_USED)) && (ADC_IPW_BCTU_AVAILABLE == STD_ON)) \
    )
static inline void Adc_Ipw_ReadData(const Adc_GroupConfigurationType * GroupPtr,
                                    Adc_ValueGroupType * Result,
                                    const Adc_StreamNumSampleType GroupSamples,
                                    const Adc_ChannelIndexType Index,
                                    const uint16 ConvResult);
#endif /* defined(ADC_ANY_UNIT_NORMAL_ISR_USED) ||... */

#if (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON)
static inline void Adc_Ipw_CallExtraNotification(Adc_GroupType Group,
                                                 uint8 UserId);
#endif /* (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON) */
#endif  /* (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || ... */

#if (defined(ADC_ANY_UNIT_WDG_ISR_USED))
#if defined(ADC_WDG_SUPPORTED)
static inline void Adc_Ipw_WdgThresholdNotification(const Adc_HwUnitType PhysicalAdcUnit,
                                                    const Adc_ChannelType PhysicalChanId,
                                                    const uint8 Flags);
#endif /* defined(ADC_WDG_SUPPORTED) */
#endif /* defined(ADC_ANY_UNIT_WDG_ISR_USED) */


#if (STD_ON == ADC_IPW_SDADC_IS_USED)

#if ( defined(ADC_ANY_UNIT_FIFOFULL_ISR_USED) || defined(ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED) )

static inline void Adc_Ipw_UpdateGroupStateSdAdc(const uint8 UserId,
                                                 const Adc_HwUnitType Unit,
                                                 const Adc_GroupType Group,
                                                 const Adc_StreamNumSampleType GroupSamples,
                                                 const Adc_HwUnitType PhysicalHwUnitId);
                                                 
static inline void Adc_Ipw_UpdateGroupStateReenableSdAdc(const Adc_HwUnitType PhysicalHwUnitId);

static inline Adc_StreamNumSampleType Adc_Ipw_CalcAvailableSamplesSdAdc(const uint8 UserId,
                                                                        const Adc_HwUnitType Unit);

static inline Adc_StreamNumSampleType Adc_Ipw_RecordResultSdAdc(const uint8 UserId,
                                                                const Adc_HwUnitType Unit,
                                                                const Adc_GroupType Group,
                                                                const Adc_StreamNumSampleType GroupSamples,
                                                                const Adc_HwUnitType PhysicalHwUnitId);

static inline void Adc_Ipw_EndSoftwareConvSdAdc(const uint8 UserId,
                                                const Adc_HwUnitType Unit,
                                                const Adc_GroupType Group);

static inline void Adc_Ipw_FifoFullNotification(const Adc_HwUnitType PhysicalAdcUnit);

#endif /* ( defined(ADC_ANY_UNIT_FIFOFULL_ISR_USED) || defined(ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED) ) */


#ifdef ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED

static inline Adc_StreamNumSampleType Adc_Ipw_GetDmaTransferSamplesSdadc(const uint8 UserId,
                                                                         const Adc_GroupType Group,
                                                                         const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                                         const Adc_StreamNumSampleType GroupSamples);

static inline void Adc_Ipw_ResetDmaDestinationAddress(const Adc_HwUnitType LogicalHwUnitId,
                                                      const Adc_GroupConfigurationType * const GroupPtr,
                                                      const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                      const uint32 AdcDmaLogicChId,
                                                      const uint32 ResultsBufferrAddress);

