rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
#if (STD_ON == SDADC_IP_DSPSS_ENABLED)

static inline void Adc_Ipw_ResetDmaSourceAddress(const Adc_HwUnitType LogicalHwUnitId,
                                                 const Adc_HwUnitType PhysicalHwUnitId,
                                                 const Adc_GroupConfigurationType * const GroupPtr,
                                                 const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                 const uint32 AdcDmaLogicChId);

#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */

#endif /* ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED */

#endif /* (STD_ON == ADC_IPW_SDADC_IS_USED) */


/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/
#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_INJECTED_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
     defined(ADC_ANY_UNIT_FIFOFULL_ISR_USED) || \
     defined(ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED) \
    )

#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_INJECTED_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
    ((ADC_HW_TRIGGER_API == STD_ON) && (defined(ADC_ANY_UNIT_BCTU_LIST_ISR_USED)) && (ADC_IPW_BCTU_AVAILABLE == STD_ON)) \
    )

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
/**
* @brief          This function check if channel is enabled/disabled.
* @details        This function check if channel is enabled/disabled.
*
* @param[in]      LogicalHwUnitId   Hardware index in the structure.
* @param[in]      GroupId           Group index.
* @param[in]      ChIndex           Channel index of group.
* @param[in]      UserId            Current UserId.
*
* @return         Std_ReturnType    E_OK or E_NOT_OK.
* @retval         E_OK              Channel is enabled.
* @retval         E_NOT_OK          Channel is disabled.
*
*/
static inline Std_ReturnType Adc_Ipw_IsChannelEnable(Adc_HwUnitType LogicalHwUnitId,
                                                     Adc_GroupType GroupId,
                                                     Adc_ChannelType ChIndex,
                                                     uint8 UserId)
{
    uint32 ChannelEnBit = 0UL;
    Std_ReturnType ReturnValue = (Std_ReturnType)E_NOT_OK;
    const uint32 PhysicalChanId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->ChannelConfigsPtr[ChIndex].ChanIndex;

    if (PhysicalChanId < 32u)
    {
        ChannelEnBit = (Adc_axRuntimeChansEnMask[GroupId].ChanMaskArr[0u] >> PhysicalChanId) & 1UL;
    }
    #if (ADC_IPW_NUM_OF_GROUP_CHN > 1u)
    else if (PhysicalChanId < 64u)
    {
        ChannelEnBit = (Adc_axRuntimeChansEnMask[GroupId].ChanMaskArr[1u] >> (PhysicalChanId % 32u)) & 1UL;
    }
    #endif /* (ADC_IPW_NUM_OF_GROUP_CHN > 1u) */
    #if (ADC_IPW_NUM_OF_GROUP_CHN > 2u)
    else if (PhysicalChanId < 96u)
    {
        ChannelEnBit = (Adc_axRuntimeChansEnMask[GroupId].ChanMaskArr[2u] >> (PhysicalChanId % 32u)) & 1UL;
    }
    #endif /* (ADC_IPW_NUM_OF_GROUP_CHN > 2u) */
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }
    #if (ADC_IPW_NUM_OF_GROUP_CHN > 3u)
    #error "Adc IPW ADC_IPW_NUM_OF_GROUP_CHN out of range."
    #endif /* (ADC_IPW_NUM_OF_GROUP_CHN > 3u) */

    if (1UL == ChannelEnBit)
    {
        ReturnValue = (Std_ReturnType)E_OK;
    }

    return ReturnValue;
}
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */

/**
* @brief          This function gets the conversion result and save to buffer
* @details        This function gets the conversion result and save to buffer
*
* @param[in]      Unit              The used hardware unit
* @param[in]      Group             The group to be converted
* @param[in]      GroupSamples      Number of group samples
* @param[in]      UserId            Current UserId
*
* @return         Std_ReturnType    Checking value
* @retval         E_OK              Result is satisfied limit checking function
* @retval         E_NOT_OK          Result is NOT satisfied limit checking function
*
* @implements Adc_Ipw_RecordResult_Activity
*/
static inline Std_ReturnType Adc_Ipw_RecordResult(Adc_HwUnitType Unit,
                                                  Adc_GroupType Group,
                                                  Adc_StreamNumSampleType GroupSamples,
                                                  uint8 UserId)
{
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    Adc_ChannelIndexType Ch = 0U;
    Adc_ChannelType ChIndex = 0U;
    Adc_ValueGroupType * Result = NULL_PTR;
    Std_ReturnType ReturnValue = (Std_ReturnType)E_OK;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
    const Adc_GroupDefType * Channel;
    const Adc_Sar_Ip_ConfigType * AdcPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcConfigPtrArr[Unit];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    Adc_Sar_Ip_ChanResultType AdcResult;
    Adc_TriggerSourceType GrTriggerSrc = GroupPtr->TriggerSource;

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    Adc_GroupType GroupId;
    Std_ReturnType ChannelEnable;
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    /* Flag to set if ADC results are in the range selected */
    boolean Flag;
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */
    Adc_ChannelIndexType ChannelCount;

#if (ADC_SETCHANNEL_API == STD_ON)
    /* Get channel count at runtime */
    ChannelCount = Adc_axRuntimeGroupChannel[Group].ChannelCount;
    Channel = &(Adc_axRuntimeGroupChannel[Group].ChannelPtr[0u]);
#else
    /* Get channel count from configuration */
    ChannelCount = GroupPtr->AssignedChannelCount;
    Channel = &(GroupPtr->AssignmentPtr[0u]);
#endif

#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
    /* Get the result buffer pointer */
    if (FALSE == GroupPtr->StreamResultGroupMultiSets)
    {
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */
        Result = &(Adc_axGroupStatus[Group].ResultsBufferPtr[Adc_axGroupStatus[Group].ResultIndex]);
#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
    }
    else
    {
        Result = &(Adc_axGroupStatus[Group].ResultsBufferPtr[Adc_axGroupStatus[Group].ResultIndex * ChannelCount]);
    }
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */

    for (Ch = 0U; Ch < ChannelCount; Ch++)
    {
        ChIndex = Channel[Ch];

        /* Get the result */
        if (ADC_TRIGG_SRC_SW == GrTriggerSrc)
        {
            Adc_Sar_Ip_GetConvResult(PhysicalHwUnitId, (uint32)(AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex), (Adc_Sar_Ip_ConvChainType)GroupPtr->Type, &AdcResult);
        }
#if (STD_ON == ADC_HW_TRIGGER_API)
        else
        {
            if (GroupPtr->HwTriggerSource <= (Adc_HwTriggerTimerType) ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
            {
                /* Data conversion comes from CTU Trigger */
                Adc_Sar_Ip_GetConvResult(PhysicalHwUnitId, (uint32)(AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex), ADC_SAR_IP_CONV_CHAIN_CTU, &AdcResult);
            }
            else
            {
                /* Data conversion comes from Normal and Injected Trigger */
                Adc_Sar_Ip_GetConvResult(PhysicalHwUnitId, (uint32)(AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex), (Adc_Sar_Ip_ConvChainType)GroupPtr->Type, &AdcResult);
            }
        }
#endif /* (STD_ON == ADC_HW_TRIGGER_API) */

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
        /* Get index of the group with AdcEnableChDisableChGroup enabled */
        GroupId = (Adc_GroupType)GroupPtr->EnableChDisableChGroupIndex;
        /* Check if group have AdcEnableChDisableChGroup enabled */
        if (ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX != GroupId)
        {
            /* Check if ChIndex is enabled */
            ChannelEnable = Adc_Ipw_IsChannelEnable(Unit, GroupId, ChIndex, UserId);
        }
        else
        {
            /* ChIndex is always enabled when AdcEnableChDisableChGroup disabled */
            ChannelEnable = E_OK;
        }
        if ((Std_ReturnType)E_OK == ChannelEnable)
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
        {
            /* If channel is enabled, check valid and result bit */
            if (TRUE == AdcResult.ValidFlag)
            {
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
                /* Checks if conversion values are in the configured range */
                if (
                        (TRUE == GroupPtr->AdcGroupLimitcheck)
#if (ADC_SETCHANNEL_API == STD_ON)
                        || (TRUE == Adc_axRuntimeGroupChannel[Group].AdcRuntimeGroupLimitcheck)
#endif /* ADC_SETCHANNEL_API == STD_ON */
                   )
                {
                    Flag = Adc_Ipw_CheckConversionValuesInRange(AdcResult.ConvData, Unit, ChIndex, UserId);
                    if (TRUE == Flag)
                    {
                        Adc_Ipw_ReadData(GroupPtr, Result, GroupSamples, Ch, AdcResult.ConvData);
                    }
                    else
                    {
                        /* SWS_Adc_00448 */
                        /* Return an error */
                        Adc_axGroupStatus[Group].AlreadyConverted = ADC_ALREADY_CONVERTED;
                        Adc_axGroupStatus[Group].LimitCheckFailed = TRUE;

                        ReturnValue = (Std_ReturnType)E_NOT_OK;
                    }
                }
                else /* In case of AdcGroupLimitcheck = FALSE */
                {
                    Adc_Ipw_ReadData(GroupPtr, Result, GroupSamples, Ch, AdcResult.ConvData);
                    Adc_axGroupStatus[Group].LimitCheckFailed = FALSE;
                }
#else
                Adc_Ipw_ReadData(GroupPtr, Result, GroupSamples, Ch, AdcResult.ConvData);
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */
            }
            else /* In case of result is not true for this convert type*/
            {
                ReturnValue = (Std_ReturnType)E_NOT_OK;
            }

            if ((Std_ReturnType)E_NOT_OK == ReturnValue)
            {
                break;
            }
        }
    }
    return ReturnValue;
}
#endif /* defined(ADC_ANY_UNIT_NORMAL_ISR_USED) ||... */      
#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
     ((defined(ADC_ANY_UNIT_INJECTED_ISR_USED)) && (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON))  \
    ) 
static inline Adc_StreamNumSampleType Adc_Ipw_GetNumsCurrentSample(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                                   const Adc_GroupConfigurationType * const GroupPtr,
                                                                   boolean RuntimeChanUpdated)
{
    Adc_StreamNumSampleType NumsCurrentSample = 0U;
    const Adc_GroupType Group = GroupPtr->GroupId;
#ifdef ADC_DMA_SUPPORTED
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
    uint32 CurrentIter = 0U;
    const Adc_HwUnitType LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    const Adc_StreamNumSampleType GroupSamples = GroupPtr->NumSamples;
    const uint32 AdcDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[LogicalHwUnitId];
    const uint32 AdcCountingDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcCountingDmaChanLogicId[LogicalHwUnitId];

    if (TRUE == GroupPtr->AdcOptimizeDmaStream)
    {
        if (1U < (GroupPtr->AssignedChannelCount))
        {
            (void)Dma_Ip_GetLogicChannelParam(AdcCountingDmaLogicChId, DMA_IP_CH_GET_CURRENT_ITER_COUNT, &CurrentIter);
        }
        else
        {
            (void)Dma_Ip_GetLogicChannelParam(AdcDmaLogicChId, DMA_IP_CH_GET_CURRENT_ITER_COUNT, &CurrentIter);
        }

