rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
        /* This condition only occurs at half interrupt */
        if (CurrentIter != GroupSamples)
        {
            /* Re-calculate NumsCurrentSample because CITER decrements its value from GroupSamples to 1 */
            NumsCurrentSample = GroupSamples - (Adc_StreamNumSampleType)CurrentIter;
        }
        else
        {
            /* When major loop completed, CITER roll back to be equal to GroupSamples so no need to re-calculate */
            NumsCurrentSample = (Adc_StreamNumSampleType)CurrentIter;
        }
        Adc_axGroupStatus[Group].ResultIndex = NumsCurrentSample;
    }
    else
#endif /* (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */
#endif /* ADC_DMA_SUPPORTED */
    {
        if (
            (ADC_TRIGG_SRC_SW != GroupPtr->TriggerSource)
#if (ADC_SETCHANNEL_API == STD_ON)
             && (FALSE == RuntimeChanUpdated)
#endif /* (ADC_SETCHANNEL_API == STD_ON) */
           )
        {
            /* Increment ResultIndex with modulo 'NumSamples' to remember that another sample is completed */
            Adc_axGroupStatus[Group].ResultIndex++;
        }
        NumsCurrentSample = Adc_axGroupStatus[Group].ResultIndex;
    }

    /* Avoid Compiler Warning */
    (void) AdcIpwConfigPtr;
    (void) RuntimeChanUpdated;

    return NumsCurrentSample;
}
#endif /* defined(ADC_ANY_UNIT_NORMAL_ISR_USED) ||... */

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
/**
* @brief          This function checks group notification
* @details        This function checks group notification
*
* @param[in]      Group             The group to be converted
* @param[in]      UserId            Current UserId
*
* @return         boolean      Checking result
* @retval         TRUE:        Notification call is available
* @retval         FALSE:       Notification call is NOT available
*
*/
static inline boolean Adc_Ipw_CheckNotification(Adc_GroupType Group,
                                                uint8 UserId)
{
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    boolean CallNotification =  FALSE;

    /* SWS_Adc_00080, SWS_Adc_00083 */
    if ((ADC_NOTIFICATION_ENABLED == Adc_axGroupStatus[Group].Notification) && \
        (NULL_PTR != Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].Notification)
       )
    {
        CallNotification =  TRUE;
    }
    return CallNotification;
}
#endif /* ADC_GRP_NOTIF_CAPABILITY == STD_ON */

#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
     ((defined(ADC_ANY_UNIT_INJECTED_ISR_USED)) && (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)) || \
     defined(ADC_ANY_UNIT_FIFOFULL_ISR_USED) || \
     defined(ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED) \
    )
/**
* @brief          This function updates queue
* @details        This function updates queue elements after a conversion
*                 and start conversion if requests are still available in queue
*
* @param[in]      Unit              The ADC hardware unit
* @param[in]      UserId            Current UserId
*
* @return         void
*
*/
static inline void Adc_Ipw_UpdateQueue(Adc_HwUnitType Unit,
                                       uint8 UserId)
{
#if (ADC_ENABLE_QUEUING == STD_ON)
    /* Remove current request element in queue */
    Adc_Ipw_RemoveFromQueue(Unit, 0U);
#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
    if (Adc_axUnitStatus[Unit].SwNormalQueueIndex > (Adc_QueueIndexType)0U)
    {
        /* Start conversion if request elements are still available in queue */
        Adc_Ipw_StartNormalConversion(Unit, UserId);
    }
#endif
#else
    /* No element will be present in the queue */
    Adc_axUnitStatus[Unit].SwNormalQueueIndex= (Adc_QueueIndexType)0;
#endif /* ADC_ENABLE_QUEUING == STD_ON */
    (void)UserId;
}
#endif /* defined(ADC_ANY_UNIT_NORMAL_ISR_USED) ||... */

#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
     ((defined(ADC_ANY_UNIT_INJECTED_ISR_USED)) && (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON))  \
    )  
/**
* @brief          This function update state of software conversion according to AutoSar diagrams
* @details        This function update state of software conversion according to AutoSar diagrams
*
* @param[in]      Unit              ADC hardware unit
* @param[in]      Group             ADC group number
* @param[in]      GroupSamples      Number of samples per channel in streaming access mode
* @param[in]      InjectedFlag      Normal or injected conversion
* @param[in]      UserId            Current UserId
*
* @return         void
*
*/
static inline void Adc_Ipw_UpdateGroupState(Adc_HwUnitType Unit,
                                            Adc_GroupType Group,
                                            Adc_StreamNumSampleType GroupSamples,
                                            boolean InjectedFlag,
                                            uint8 UserId)
{
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    Adc_StreamNumSampleType CurrentSampleCount = 0U;
    const Adc_Ipw_Config * const AdcIpwConfigPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr;
#ifdef ADC_DMA_SUPPORTED
    const uint32 AdcDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[Unit];
    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[1U];
#endif /* ADC_DMA_SUPPORTED */
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    boolean  CallNotification = FALSE;
#endif
    boolean StreamBuffLinear = FALSE;

    CurrentSampleCount = Adc_Ipw_GetNumsCurrentSample(AdcIpwConfigPtr, GroupPtr, FALSE);
    /* At least once the group was converted */
    Adc_axGroupStatus[Group].AlreadyConverted = ADC_ALREADY_CONVERTED;

    if (ADC_BUSY == Adc_axGroupStatus[Group].Conversion)
    {
        /* SWS_Adc_00224 */
        Adc_axGroupStatus[Group].Conversion = ADC_COMPLETED;
    }

