rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
    return ReturnValue;
}
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
#endif /* ADC_ANY_UNIT_DMA_TRANSFER_USED */

#endif /* ADC_DMA_SUPPORTED */

#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
     ((defined(ADC_ANY_UNIT_INJECTED_ISR_USED)) && (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)) \
    )
#if (ADC_SETCHANNEL_API == STD_ON)
/**
* @brief          This function reconfigures runtime updated channels
* @details        This function reconfigures runtime updated channels for software trigger groups
*
* @param[in]      GroupPtr                  Group configuration pointer
* @param[in]      PhysicalHwUnitId             Adc Physical Unit Id
* @param[in]      InjectedFlag              Injected (TRUE) or Normal (FALSE) group
* @param[in]      UserId                    Current UserId
*
* @return         void.
*/
static inline void Adc_Ipw_ConfigureRuntimeSoftwareGroup(const Adc_GroupConfigurationType * GroupPtr,
                                                         Adc_HwUnitType PhysicalHwUnitId,
                                                         boolean InjectedFlag,
                                                         uint8 UserId)
{
    Adc_Sar_Ip_ConvChainType ChainType = ADC_SAR_IP_CONV_CHAIN_NORMAL;
    uint32 EndChainFlag = ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN;
    Adc_GroupType Group = GroupPtr->GroupId;
    Adc_HwUnitType LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    Adc_Sar_Ip_ChansIdxMaskType CmrMask;

    if (ADC_SAR_IP_STATUS_SUCCESS == Adc_Sar_Ip_AbortChain(PhysicalHwUnitId, TRUE, FALSE))
    {
#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
        if (TRUE == InjectedFlag)
        {
            ChainType = ADC_SAR_IP_CONV_CHAIN_INJECTED;
            EndChainFlag = ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN;
        }
#else
        (void)InjectedFlag;
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */

        Adc_axGroupStatus[Group].ResultIndex = 0U;
        /* Get run-time configuration and update normal conversion mask registers */
        Adc_Ipw_GetCmrRegister(LogicalHwUnitId, Group, &CmrMask, UserId);
        Adc_Sar_Ip_ChainConfig(PhysicalHwUnitId, &CmrMask, ChainType);
        /* Clear pending ISR request which might occur with continuous groups */
        Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, EndChainFlag);
        Adc_axRuntimeGroupChannel[Group].RuntimeUpdated = FALSE;

        /* Restart group conversion */
        Adc_Sar_Ip_StartConversion(PhysicalHwUnitId, ChainType);
    }
}
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

/**
* @brief          This function handles the normal conversion ending.
* @details        When a normal (not injected) conversion ends, and the end of
*                 conversion ISR is called, this function takes care about the
*                 driver and the module state transitions.
*
* @param[in]      Unit                the current HW Unit.
* @param[in]      InjectedFlag        Normal or Injected conversion.
* @param[in]      UserId              Current UserId
*
* @return         void
*
* @api
* @implements     Adc_Ipw_EndSoftwareConv_Activity
*/
static inline void Adc_Ipw_EndSoftwareConv(Adc_HwUnitType Unit,
                                           boolean InjectedFlag,
                                           uint8 UserId)
{
    Adc_GroupType GroupIndex = 0U;
    Adc_GroupType Group = 0U;
    /* Streaming num samples should be at least 1U */
    Adc_StreamNumSampleType GroupSamples;
    Std_ReturnType CheckingStatus = (Std_ReturnType) E_OK;
#if defined(ADC_DMA_SUPPORTED) || (ADC_SETCHANNEL_API == STD_ON)
    const Adc_GroupConfigurationType * GroupPtr; /* Pointer to AdcGroup */
#endif /* defined(ADC_DMA_SUPPORTED) || (ADC_SETCHANNEL_API == STD_ON) */
#ifdef ADC_DMA_SUPPORTED
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    Std_ReturnType LimitCheckDmaStatus = (Std_ReturnType) E_OK;
    const uint32 AdcDmaLogicChId = (uint32) Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[Unit];
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */
#endif /*ADC_DMA_SUPPORTED*/
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    /* Get the group to be converted */
#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
    if (TRUE == InjectedFlag)
    {
        Group = Adc_axUnitStatus[Unit].SwInjectedQueue[0];
    }
    else
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */
    {
        Group = Adc_axUnitStatus[Unit].SwNormalQueue[0];
    }

    GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    GroupSamples = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].NumSamples;

#if defined(ADC_DMA_SUPPORTED) || (ADC_SETCHANNEL_API == STD_ON)
    GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
#endif /* defined(ADC_DMA_SUPPORTED) || (ADC_SETCHANNEL_API == STD_ON) */

#if (ADC_SETCHANNEL_API == STD_ON)
    /* Check if channel was updated before interrupt of previous conversions */
    if (TRUE == Adc_axRuntimeGroupChannel[Group].RuntimeUpdated)
    {
        Adc_Ipw_ConfigureRuntimeSoftwareGroup(GroupPtr, PhysicalHwUnitId, InjectedFlag, UserId);
    }
    else
#endif /* (ADC_SETCHANNEL_API == STD_ON) */
    {
#ifdef ADC_DMA_SUPPORTED
        if (ADC_DMA != Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
        {
#endif /*ADC_DMA_SUPPORTED*/
            /* Get the conversion result and save to buffer */
            CheckingStatus = Adc_Ipw_RecordResult(Unit, Group, GroupSamples, UserId);
#ifdef ADC_DMA_SUPPORTED
            Adc_Sar_Ip_DisableDma(PhysicalHwUnitId);
            Adc_Sar_Ip_DisableChannelDma(PhysicalHwUnitId, GroupPtr->LastCh);
        }
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
        else
        {
            LimitCheckDmaStatus = Adc_Ipw_CheckGroupConvResultDma(GroupPtr, AdcDmaLogicChId, UserId);
        }
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
#endif /*ADC_DMA_SUPPORTED*/

#if (defined(ADC_DMA_SUPPORTED) && (ADC_ENABLE_LIMIT_CHECK == STD_ON))
        if ((Std_ReturnType)E_OK == LimitCheckDmaStatus)
#endif /* defined(ADC_DMA_SUPPORTED) && (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
        {
#if (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON)
            /* Call extra notification (if available) before updating registers (SWS_Adc_00060) */
            Adc_Ipw_CallExtraNotification(Group, UserId);
#endif /* (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON) */

#if (ADC_SETCHANNEL_API == STD_ON)
            if (TRUE == Adc_axRuntimeGroupChannel[Group].RuntimeUpdated)
            {
                Adc_Ipw_ConfigureRuntimeSoftwareGroup(GroupPtr, PhysicalHwUnitId, InjectedFlag, UserId);
            }
            else
#endif /* (ADC_SETCHANNEL_API == STD_ON) */
            {
#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
                if (TRUE == InjectedFlag)
                {
    #ifdef ADC_DMA_SUPPORTED
        #if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
                    if (ADC_DMA == Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
                    {
                        if (Adc_axUnitStatus[Unit].SwNormalQueueIndex > (Adc_QueueIndexType)0U)
                        {
                            /* Restart normal conversion */
                            Adc_Ipw_StartNormalConversion(Unit, UserId);
                        }
                    }
        #endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */
    #endif /* ADC_DMA_SUPPORTED */
                    if ((Std_ReturnType)E_NOT_OK == CheckingStatus)
                    {
                        Adc_axGroupStatus[Group].ResultIndex = 0U;
                    }
                }
                else
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */
                {
                    if ((Std_ReturnType)E_NOT_OK == CheckingStatus)
                    {
                        if (ADC_CONV_MODE_ONESHOT == Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].Mode)
                        {
                            /* Disable end of chain interrupt mask */
#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED))
                            Adc_Sar_Ip_DisableNotifications(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);
#endif /* (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) */
                        }

                        /* Clear normal interrupt flag */
                        Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);
                    }
#ifdef ADC_DMA_SUPPORTED
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
                    if (FALSE == GroupPtr->AdcOptimizeDmaStream)
#endif /* (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */
#endif /* ADC_DMA_SUPPORTED */
                    {
                        if ((Std_ReturnType)E_OK == CheckingStatus)
                        {
                            /* Increment ResultIndex with modulo 'NumSamples' to remember that another sample is completed */
                            Adc_axGroupStatus[Group].ResultIndex++;
                        }
                    }
                }
            }
            if ((Std_ReturnType)E_OK == CheckingStatus)
            {
                /* Update group state and continue conversion */
                Adc_Ipw_UpdateGroupState(Unit, Group, GroupSamples, InjectedFlag, UserId);
            }
        }
    }
}
#endif /* defined(ADC_ANY_UNIT_NORMAL_ISR_USED) ||... */

#if (ADC_HW_TRIGGER_API == STD_ON)
#if ( \
        ((defined(ADC_ANY_UNIT_NORMAL_ISR_USED)) && (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)) || \
        defined(ADC_ANY_UNIT_INJECTED_ISR_USED) || \
        defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
        ((defined(ADC_ANY_UNIT_BCTU_LIST_ISR_USED)) && (ADC_IPW_BCTU_AVAILABLE == STD_ON)) \
    )
#if (ADC_SETCHANNEL_API == STD_ON)
/**
* @brief          This function configs command lists for trigger unit
*                 channel in adc unit when a hardware conversion ends
*
* @details        This function configs command lists for trigger unit
*                 channel in adc unit when a hardware conversion ends
*
* @param[in]      Unit                  The current HW Unit.
* @param[in]      InjectedFlag          Normal or Injected conversion.
* @param[in]      UserId                Current UserId
*
* @return         Std_ReturnType
*
* @api
* @implements     Adc_Ipw_ConfigureRuntimeHardwareGroup_Activity
*/
static inline Std_ReturnType Adc_Ipw_ConfigureRuntimeHardwareGroup(Adc_HwUnitType Unit,
                                                                   boolean InjectedFlag,
                                                                   uint8 UserId)
{
    Adc_Sar_Ip_ChansIdxMaskType CmrMask;
    Std_ReturnType ReturnStatus = (Std_ReturnType)E_OK;

