rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
    uint8 ChanList[ADC_MAX_CHANNEL_PER_HW_UNIT];
    Adc_ChannelIndexType ChannelCount;
    Bctu_Ip_TrigConfigType TrigConfig;
    Bctu_Ip_StatusType BctuStatus;
    const Adc_Ipw_Config * const AdcIpwConfigPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr;
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */
    const Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
    /* Mapping AdcPhysicalID to CtuPhysicalId */
    const uint8 AdcIdToCtuId[ADC_IPW_MAX_HW_UNITS] = ADC_IPW_ADC_TO_CTU_MAPPING_ARRAY;
    const uint8 CtuPhysicalId = AdcIdToCtuId[PhysicalHwUnitId];
    /* Set AdcIndex corresponding to bitfield in BCTU. eg: ADC0-2: BCTU0 and ADC3-6: BCTU1 */
    const uint8 AdcIndexOffset[ADC_IPW_CTU_MAX_HW_UNITS] = ADC_IPW_ADC_INDEX_OFFSET_BITFIELD_ARRAY;
    const uint8 AdcIndexForCtu = PhysicalHwUnitId - AdcIndexOffset[CtuPhysicalId];
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */

    /* Get the group to be converted */
    Adc_GroupType Group = Adc_axUnitStatus[Unit].OngoingHwGroup;
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);

#if ((ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) && ((ADC_IPW_CTU_AVAILABLE == STD_ON) || (ADC_IPW_BCTU_AVAILABLE == STD_ON)))
    if (GroupPtr->HwTriggerSource <= (Adc_HwTriggerTimerType)ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
    {
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
        Bctu_Ip_SetGlobalTriggerEn(CtuPhysicalId, FALSE);

        /* Get index of List channel register */
        TrigConfig.TrigIndex       = (uint8)GroupPtr->HwTriggerSource;
        TrigConfig.LoopEn         = FALSE;
        TrigConfig.DataDest       = BCTU_IP_DATA_DEST_ADC_DATA_REG;
        TrigConfig.HwTriggersEn   = TRUE;
        TrigConfig.AdcTargetMask = (1u << AdcIndexForCtu);
        TrigConfig.TrigType = BCTU_IP_TRIG_TYPE_LIST;
        /* Use list address start index allocated for the HW unit */
        TrigConfig.AdcChanOrListStart = AdcIpwConfigPtr->CtuListStartIndex[Unit];

        BctuStatus = Bctu_Ip_ConfigTrigger(CtuPhysicalId, &TrigConfig);
        if (BctuStatus == BCTU_IP_STATUS_SUCCESS)
        {
            ChannelCount = Adc_axRuntimeGroupChannel[Group].ChannelCount;

            Adc_Ipw_GetCtuChanList(ChanList, (uint8)ChannelCount, Group, Unit, UserId);

            Bctu_Ip_ConfigChanListSimple(CtuPhysicalId, AdcIpwConfigPtr->CtuListStartIndex[Unit], ChanList, ChannelCount);

            Bctu_Ip_SetGlobalTriggerEn(CtuPhysicalId, TRUE);
        }
        else
        {
            ReturnStatus = (Std_ReturnType)E_NOT_OK;
        }
#else /* ADC_IPW_BCTU_AVAILABLE */
        ReturnStatus = Adc_Ipw_CtuTriggerEnable(Group, GroupPtr->HwTriggerSource, TRUE, TRUE, UserId);
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */
    }
    else
#endif /* (ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) && ((ADC_IPW_CTU_AVAILABLE == STD_ON) || (ADC_IPW_BCTU_AVAILABLE == STD_ON)) */
    {
        Adc_Ipw_GetCmrRegister(Unit, Group, &CmrMask, UserId);
        if (TRUE == InjectedFlag)
        {
            Adc_Sar_Ip_ChainConfig(PhysicalHwUnitId, &CmrMask, ADC_SAR_IP_CONV_CHAIN_INJECTED);
        }
    #if (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)
        else
        {
            Adc_Sar_Ip_ChainConfig(PhysicalHwUnitId, &CmrMask, ADC_SAR_IP_CONV_CHAIN_NORMAL);
        }
    #endif /* (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON) */
    }

    if (ReturnStatus == (Std_ReturnType)E_OK)
    {
        Adc_axGroupStatus[Group].ResultIndex = 0U;
        Adc_axRuntimeGroupChannel[Group].RuntimeUpdated =  FALSE;
    }

    return ReturnStatus;
}
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
#ifdef ADC_DMA_SUPPORTED
static void Adc_Ipw_ResetResultPointer(const Adc_GroupConfigurationType * GroupPtr,
                                        const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                        uint32 AdcDmaLogicChId)
{
    const Adc_GroupType Group = GroupPtr->GroupId;
    const Adc_HwUnitType Unit = GroupPtr->AdcLogicalUnitId;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    const Adc_HwUnitType PhysicalHwUnitId = AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[1U];
    /* Check the DMA of ADC instance */
    if (ADC_DMA == AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
    {
        if (((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable) && (1U == GroupPtr->AssignedChannelCount))
        {
            LocTransferList[0].Param = DMA_IP_CH_SET_DESTINATION_ADDRESS;
            LocTransferList[0].Value = (Adc_Sar_Ip_uintPtrType)(&(Adc_axGroupStatus[Group].ResultsBufferPtr[Adc_axGroupStatus[Group].ResultIndex]));
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
            if (PhysicalHwUnitId >= ADC_INSTANCE_COUNT)
            {
                LocTransferList[0].Value -= ADC_SAR_IP_APPLICATION_EXTENSION_BASE_ADDRESS;
            }
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
            /* Write TCD Configuration for the channel */
            (void)Dma_Ip_SetLogicChannelTransferList(AdcDmaLogicChId, LocTransferList, 1U);
        }
    }
}
#endif /* ADC_DMA_SUPPORTED */
/**
* @brief          This function disable trigger source and notifications.
* @details        This function disable trigger source and notifications.
*
* @param[in]      Unit                 The current HW Unit.
* @param[in]      InjectedFlag         Normal or Injected conversion.
* @param[in]      TriggerSrc           Hardware trigger source
* @param[in]      UserId               Current UserId
*
* @return         void
*
* @api
* @implements     Adc_Ipw_DisableHwTriggerSrc_Activity
*/
static inline void Adc_Ipw_DisableHwTriggerSrc(Adc_HwUnitType Unit,
                                               boolean InjectedFlag,
                                               Adc_HwTriggerTimerType TriggerSrc,
                                               uint8 UserId)
{
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

