rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
    /* Mapping AdcPhysicalID to CtuPhysicalId */
    const uint8 AdcIdToCtuId[ADC_IPW_MAX_HW_UNITS] = ADC_IPW_ADC_TO_CTU_MAPPING_ARRAY;
    const uint8 CtuPhysicalId = AdcIdToCtuId[PhysicalHwUnitId];
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */

    /* Stop Conversion */
    if (TRUE == InjectedFlag)
    {
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
        if (TriggerSrc <= (Adc_HwTriggerTimerType)ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
        {
            /* Conversion triggered by BCTU/CTU */
            Bctu_Ip_DisableHwTrigger(CtuPhysicalId, (uint8)TriggerSrc);

            /* Not needed to clear interrupt flags status, because this is already done in IPL interrupt,
            before calling the IPW function as notification */
        }
        else
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */
        {
#if (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON)
            /* Conversion is External Trigger */
            /* Disable injected external trigger input */
            Adc_Sar_Ip_SetExternalTrigger(PhysicalHwUnitId, ADC_SAR_IP_EXT_TRIG_EDGE_DISABLED, ADC_SAR_IP_INJECTED_EXT_TRIG);
#if (defined(ADC_ANY_UNIT_INJECTED_ISR_USED))
            Adc_Sar_Ip_DisableNotifications(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN);
#endif /* (defined(ADC_ANY_UNIT_INJECTED_ISR_USED) */
#endif /* #if (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON) */
        }
    }
#if (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)
    else
    {
#if (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON)
        /* Disable normal external trigger input */
#if FEATURE_ADC_HAS_AUX_EXT_TRIGGER
        Adc_Sar_Ip_SetExternalTrigger(PhysicalHwUnitId, ADC_SAR_IP_EXT_TRIG_EDGE_DISABLED, ADC_SAR_IP_ALL_NORMAL_EXT_TRIG);
#else
        Adc_Sar_Ip_SetExternalTrigger(PhysicalHwUnitId, ADC_SAR_IP_EXT_TRIG_EDGE_DISABLED, ADC_SAR_IP_NORMAL_EXT_TRIG);
#endif /* FEATURE_ADC_HAS_AUX_EXT_TRIGGER */

#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED))
        Adc_Sar_Ip_DisableNotifications(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);
#endif /* (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) */
#endif /* (ADC_EXTERNAL_TRIGGER_ENABLE == STD_ON) */
    }
#endif /* (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON) */

    Adc_axUnitStatus[Unit].OngoingHwGroup = ADC_INVALID_HW_GROUP_ID;
}
#endif /* ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF */

/**
* @brief          This function handles the conversion by hardware trigger ending.
* @details        When a hardware conversion ends, and the end of conversion
*                 ISR is called, this function takes care about the
*                 driver and the module state transitions.
*
* @param[in]      Unit                The current HW Unit.
* @param[in]      InjectedFlag        Normal or Injected conversion.
* @param[in]      UserId              Current UserId
*
* @return         void
*
* @api
* @implements     Adc_Ipw_EndHardwareConv_Activity
*/
static inline void Adc_Ipw_EndHardwareConv(Adc_HwUnitType Unit,
                                           boolean InjectedFlag,
                                           uint8 UserId)
{
    Adc_GroupType GroupIndex;
    Adc_GroupType Group;
    /* Streaming num samples should be at least 1U */
    Adc_StreamNumSampleType GroupSamples;
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    boolean  CallNotification = FALSE;
#endif /* ADC_GRP_NOTIF_CAPABILITY */
    Std_ReturnType  ReturnStatus = (Std_ReturnType) E_OK;
#if (ADC_SETCHANNEL_API == STD_ON)
    Std_ReturnType  TempStatus = (Std_ReturnType) E_OK;
#endif /* (ADC_SETCHANNEL_API == STD_ON) */
    const Adc_GroupConfigurationType * GroupPtr = NULL_PTR;
#if (defined(ADC_DMA_SUPPORTED) || (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF))
    const Adc_Ipw_Config * const AdcIpwConfigPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr;
#endif /* defined(ADC_DMA_SUPPORTED) || (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */
#ifdef ADC_DMA_SUPPORTED
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
    boolean StreamLinearDone = FALSE;
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */
    Adc_HwUnitType PhysicalHwUnitId = AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
    const uint32 AdcDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[Unit];
#endif /* defined(ADC_DMA_SUPPORTED) */
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
    boolean RuntimeChanUpdated = FALSE;
    Adc_StreamNumSampleType CurrentSampleCount = 0U;
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */

    /* Get the group to be converted. There is only one Hardware Group working at a time. */
    Group = Adc_axUnitStatus[Unit].OngoingHwGroup;
    GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);

#if (ADC_SETCHANNEL_API == STD_ON)
    if (TRUE == Adc_axRuntimeGroupChannel[Group].RuntimeUpdated)
    {
        /* Configure the new list of channels even recording results were incorrect.*/
        (void)Adc_Ipw_ConfigureRuntimeHardwareGroup(Unit, InjectedFlag, UserId);
    }
    else
#endif /* (ADC_SETCHANNEL_API == STD_ON) */
    {
        if (((ADC_CONV_TYPE_INJECTED == GroupPtr->Type) && (FALSE == InjectedFlag)) || \
            ((ADC_CONV_TYPE_NORMAL == GroupPtr->Type) && ((boolean)TRUE == InjectedFlag)) \
           )
        {
            /* Return when group conversion type doesn't match the ISR handler type (normal/injected) */
            ReturnStatus = (Std_ReturnType) E_NOT_OK;
        }

        if ((Std_ReturnType)E_OK == ReturnStatus)
        {
            GroupSamples = GroupPtr->NumSamples;

#ifdef ADC_DMA_SUPPORTED
            if (ADC_DMA != AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
            {
#endif /*ADC_DMA_SUPPORTED*/
                /* Get the conversion result and save to buffer */
                ReturnStatus = Adc_Ipw_RecordResult(Unit, Group, GroupSamples, UserId);
#ifdef ADC_DMA_SUPPORTED
                Adc_Sar_Ip_DisableDma(PhysicalHwUnitId);
                Adc_Sar_Ip_DisableChannelDma(PhysicalHwUnitId, GroupPtr->LastCh);
            }
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
            else
            {
                ReturnStatus = Adc_Ipw_CheckGroupConvResultDma(GroupPtr, AdcDmaLogicChId, UserId);
            }
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
#endif /*ADC_DMA_SUPPORTED*/
#if (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON)
        /* Call extra notification (if available) before updating registers (SWS_Adc_00060) */
            Adc_Ipw_CallExtraNotification(Group, UserId);
#endif /* (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON) */

#if (ADC_SETCHANNEL_API == STD_ON)
            if (TRUE == Adc_axRuntimeGroupChannel[Group].RuntimeUpdated)
            {
                /* Configure the new list of channels even recording results were incorrect.*/
                TempStatus = Adc_Ipw_ConfigureRuntimeHardwareGroup(Unit, InjectedFlag, UserId);
                if ((Std_ReturnType)E_NOT_OK == TempStatus)
                {
                    ReturnStatus = (Std_ReturnType)E_NOT_OK;
                }
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
                else
                {
                    RuntimeChanUpdated = TRUE;
                }
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */
            }
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

            if ((Std_ReturnType)E_OK == ReturnStatus)
            {
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
                CurrentSampleCount = Adc_Ipw_GetNumsCurrentSample(AdcIpwConfigPtr, GroupPtr, RuntimeChanUpdated);
                /* At least once the group was converted */
                Adc_axGroupStatus[Group].AlreadyConverted = ADC_ALREADY_CONVERTED;
                if (ADC_BUSY == Adc_axGroupStatus[Group].Conversion)
                {
                    /* SWS_Adc_00224 */
                    Adc_axGroupStatus[Group].Conversion = ADC_COMPLETED;
                }

