rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
                /* If all samples completed, wrap to 0 */
                if (GroupSamples <= CurrentSampleCount)
                {
                    /* SWS_Adc_00325 */
                    Adc_axGroupStatus[Group].Conversion = ADC_STREAM_COMPLETED;
                    if ((ADC_STREAM_BUFFER_LINEAR == GroupPtr->BufferMode) && (ADC_ACCESS_MODE_STREAMING == GroupPtr->AccessMode))
                    {
#ifdef ADC_DMA_SUPPORTED
                        StreamLinearDone = TRUE;
#endif /* ADC_DMA_SUPPORTED */
                        /* Disable trigger source and notification from trigger unit */
                        Adc_Ipw_DisableHwTriggerSrc(Unit, InjectedFlag, GroupPtr->HwTriggerSource, UserId);
                    }
                    else
                    {
                        Adc_axGroupStatus[Group].ResultIndex = 0U;
#ifdef ADC_DMA_SUPPORTED
                        Adc_Ipw_ResetResultPointer(GroupPtr, AdcIpwConfigPtr, AdcDmaLogicChId);
#endif /* ADC_DMA_SUPPORTED */
                    }
                }
#else
                /* SWS_Adc_00325 */
                Adc_axGroupStatus[Group].Conversion = ADC_STREAM_COMPLETED;
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
                CallNotification = Adc_Ipw_CheckNotification(Group, UserId);
                if (TRUE == CallNotification)
                {
                    /* SWS_Adc_00140, SWS_Adc_00060 */
                    GroupPtr->Notification();
                }
#endif /* ADC_GRP_NOTIF_CAPABILITY == STD_ON */

#ifdef ADC_DMA_SUPPORTED
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
                if (FALSE == StreamLinearDone)
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */
                {
                    Adc_Ipw_UpdateNextDestinationAddress(Unit, AdcIpwConfigPtr, GroupPtr);
                }
#endif /* ADC_DMA_SUPPORTED */
            }
        }
    }
#ifdef ADC_DMA_SUPPORTED
    (void)AdcDmaLogicChId;
#endif /* ADC_DMA_SUPPORTED */
}
#endif /* (((defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || ... */
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || defined(ADC_ANY_UNIT_DMA_TRANSFER_USED))
/**
* @brief          This function handles the Normal conversion ending.
* @details        When a normal conversion finishes, in callback of ISR, this function
*                 is called to update status, get the result of conversion.
*
* @param[in]      PhysicalAdcUnit   ADC Hardware Unit Physical
*
* @return         void
*
* @implements Adc_Ipw_EndNormalChainNotification_Activity
*/
static inline void Adc_Ipw_EndNormalChainNotification(const Adc_HwUnitType PhysicalAdcUnit)
{
    volatile uint8 UserId;
    Adc_HwUnitType LogicalAdcUnit;
    Adc_QueueIndexType SwNormalQueueIndex;

    /* Check that ADC unit is assigned to current user partition */
    UserId = Adc_GetUserID();

    LogicalAdcUnit = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.HwLogicalId[PhysicalAdcUnit];

    if (LogicalAdcUnit == ADC_IPW_INVALID_LOGICAL_UNIT_ID)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid user partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
        SwNormalQueueIndex = Adc_axUnitStatus[LogicalAdcUnit].SwNormalQueueIndex;
        /*Software Normal queue is not empty and End of Normal chain conversion occurred (PR-MCAL-3272.adc) */
        if (SwNormalQueueIndex > (Adc_QueueIndexType)0)
        {
            /* Handle the end of conversion */
            Adc_Ipw_EndSoftwareConv(LogicalAdcUnit, FALSE, UserId);
        }

#if (ADC_HW_TRIGGER_API == STD_ON)
#if (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)
        /* Hardware Normal queue is not empty and End of Normal chain conversion occurred (PR-MCAL-3272.adc) */
        if (ADC_INVALID_HW_GROUP_ID != Adc_axUnitStatus[LogicalAdcUnit].OngoingHwGroup)
        {
            /* Handle the end of conversion */
            Adc_Ipw_EndHardwareConv(LogicalAdcUnit, FALSE, UserId);
        }
#endif /* (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON) */
#endif /* ADC_HW_TRIGGER_API == STD_ON */
    }
}
#endif /* defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || ... */

#if (defined(ADC_ANY_UNIT_INJECTED_ISR_USED) || defined(ADC_ANY_UNIT_DMA_TRANSFER_USED))
/**
* @brief          This function handles the Injected conversion ending.
* @details        When a injected conversion finishes, in callback of ISR, this function
*                 is called to update status, get the result of conversion.
*
* @param[in]      PhysicalAdcUnit   ADC Hardware Unit Physical
*
* @return         void
*
* @implements Adc_Ipw_EndInjectedChainNotification_Activity
*/
static inline void Adc_Ipw_EndInjectedChainNotification(const Adc_HwUnitType PhysicalAdcUnit)
{
    volatile uint8 UserId;
    Adc_HwUnitType LogicalAdcUnit;
#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
    Adc_QueueIndexType SwInjectedQueueIndex;
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */

    /* Check that ADC unit is assigned to current user partition */
    UserId = Adc_GetUserID();

    LogicalAdcUnit = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.HwLogicalId[PhysicalAdcUnit];

    if (LogicalAdcUnit == ADC_IPW_INVALID_LOGICAL_UNIT_ID)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid user partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
        SwInjectedQueueIndex = Adc_axUnitStatus[LogicalAdcUnit].SwInjectedQueueIndex;
        /* Software Injected queue is not empty and End of Injected chain conversion occurred (PR-MCAL-3272.adc) */
        if (SwInjectedQueueIndex > (Adc_QueueIndexType)0)
        {
            /* Handle the end of conversion */
            Adc_Ipw_EndSoftwareConv(LogicalAdcUnit, TRUE, UserId);
        }
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */

#if (ADC_HW_TRIGGER_API == STD_ON)
        /* Hardware Injected queue is not empty and End of Injected chain conversion occurred (PR-MCAL-3272.adc) */
        if (ADC_INVALID_HW_GROUP_ID != Adc_axUnitStatus[LogicalAdcUnit].OngoingHwGroup)
        {
            /* Handle the end of conversion */
            Adc_Ipw_EndHardwareConv(LogicalAdcUnit, TRUE, UserId);
        }
#endif /* ADC_HW_TRIGGER_API == STD_ON */
    }
}
#endif /* (defined(ADC_ANY_UNIT_INJECTED_ISR_USED) */

#if (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || \
     defined(ADC_ANY_UNIT_INJECTED_ISR_USED) || \
     defined(ADC_ANY_UNIT_DMA_TRANSFER_USED) || \
    ((ADC_HW_TRIGGER_API == STD_ON) && (defined(ADC_ANY_UNIT_BCTU_LIST_ISR_USED)) && (ADC_IPW_BCTU_AVAILABLE == STD_ON)) \
    )
/**
* @brief          This function read conversion results
* @details        This function read conversion results
*
* @param[in]      GroupPtr      Group Pointer
* @param[in]      Result       Pointer to conversion results
* @param[in]      GroupSamples  Number of samples
* @param[in]      Index         Current index of result
* @param[in]      ConvResult    Conversion result
*
* @return         void
*/
static inline void Adc_Ipw_ReadData(const Adc_GroupConfigurationType * GroupPtr,
                                    Adc_ValueGroupType * Result,
                                    const Adc_StreamNumSampleType GroupSamples,
                                    const Adc_ChannelIndexType Index,
                                    const uint16 ConvResult)
{
#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
    if (FALSE == GroupPtr->StreamResultGroupMultiSets)
    {
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */
        Result[(Index * GroupSamples)] = ConvResult;
        (void)GroupPtr;
#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
    }
    else
    {
        Result[Index] = ConvResult;
    }
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */
}
#endif /* defined(ADC_ANY_UNIT_NORMAL_ISR_USED) ||... */

