rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
#if (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON)
/**
* @brief          This function calls extra notification
* @details        This function calls extra notification
*
* @param[in]      Group         The channel group to be converted
* @param[in]      UserId        Current UserId
*
* @return         void
* CPR-MCAL-797.adc, SWS_Adc_00140
*/
static inline void Adc_Ipw_CallExtraNotification(Adc_GroupType Group,
                                                 uint8 UserId)
{
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];

    /* Call notification if available */
    if (Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].ExtraNotification != NULL_PTR)
    {
        Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].ExtraNotification();
    }
}
#endif /* (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON) */
#endif  /* (defined(ADC_ANY_UNIT_NORMAL_ISR_USED) || ... */

#if (defined(ADC_ANY_UNIT_WDG_ISR_USED))
#ifdef ADC_WDG_SUPPORTED
/**
* @brief          This function handles the watchdog threshold ending.
* @details        When a conversion result is out of threshold range, in callback of ISR, this function
*                 is called to call watchdog threshold notification.
*
* @param[in]      PhysicalAdcUnit   ADC Physical Hardware Unit
* @param[in]      PhysicalChanId    ADC Physical Channel ID
*
* @return         void
*
* @implements Adc_Ipw_WdgThresholdNotification_Activity
*/
static inline void Adc_Ipw_WdgThresholdNotification(const Adc_HwUnitType PhysicalAdcUnit,
                                                    const Adc_ChannelType PhysicalChanId,
                                                    const uint8 Flags)
{
    volatile uint8 UserId;
    Adc_HwUnitType LogicalAdcUnit;
    Adc_ChannelType LogicalChanId;
    Adc_Ipw_Config const * AdcIpwConfigPtr;

    /* Check that ADC unit is assigned to current user partition */
    UserId = Adc_GetUserID();

    AdcIpwConfigPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr;
    LogicalAdcUnit = AdcIpwConfigPtr->Mapping.HwLogicalId[PhysicalAdcUnit];

    if (LogicalAdcUnit == ADC_IPW_INVALID_LOGICAL_UNIT_ID)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid user partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
        /* Call notification callback */
        LogicalChanId = AdcIpwConfigPtr->Mapping.ChannelLogicalId[LogicalAdcUnit][PhysicalChanId];

        AdcIpwConfigPtr->AdcIpwChannelConfig[LogicalAdcUnit][LogicalChanId].WdgNotification(Flags);
    }
}
#endif /* ADC_WDG_SUPPORTED */
#endif /* defined(ADC_ANY_UNIT_WDG_ISR_USED) */

/*==================================================================================================
*                                   GLOBAL FUNCTION PROTOTYPES
==================================================================================================*/

/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/

/*==================================================================================================
                                          ADC HW UNIT 0
==================================================================================================*/
#if ((defined(ADC_UNIT_0_WDG_ISR_USED)) && (defined(ADC_WDG_SUPPORTED)))
/**
* @brief          This function implements the Wdg threshold notification for
*                 ADC Hardware Unit 0.
* @details        This function implements the Wdg threshold notification for
*                 ADC Hardware Unit 0.
*
* @return         void
*
*/
void Adc_Ipw_Adc0WdgThresholdNotification(const uint16 PhysicalChanId,
                                          const uint8 Flags)
{
    const Adc_HwUnitType PhysicalAdcUnit = 0U;

    Adc_Ipw_WdgThresholdNotification(PhysicalAdcUnit, (Adc_ChannelType)PhysicalChanId, Flags);
}
#endif /* ((defined(ADC_UNIT_0_WDG_ISR_USED)) && (defined(ADC_WDG_SUPPORTED))) */

#ifdef ADC_UNIT_0_NORMAL_ISR_USED
/**
* @brief          This function implements the end of normal chain notification for
*                 ADC Hardware Unit 0.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 0.
*
* @return         void
*
*/
void Adc_Ipw_Adc0EndNormalChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 0U;

    Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_0_NORMAL_ISR_USED */

#ifdef ADC_UNIT_0_INJECTED_ISR_USED
/**
* @brief          This function implements the end of injected chain notification for
*                 ADC Hardware Unit 0.
* @details        This function implements the end of injected chain notification for
*                 ADC Hardware Unit 0.
*
* @return         void
*
*/
void Adc_Ipw_Adc0EndInjectedChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 0U;

    Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_0_INJECTED_ISR_USED */

#if (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_0_DMA_TRANSFER_USED))
/**
* @brief          This function implements the end of dma transfer notification for
*                 ADC Hardware Unit 0.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 0.
*
* @return         void
*
*/
void Adc_Ipw_Adc0DmaTransferCompleteNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 0U;
    uint32 AdcStatusFlag;

    AdcStatusFlag = Adc_Sar_Ip_GetStatusFlags(PhysicalAdcUnit);

    if ((AdcStatusFlag & ADC_SAR_IP_STATUS_FLAG_NORMAL_ENDCHAIN) != 0U)
    {
        Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
    }
    else if ((AdcStatusFlag & (ADC_SAR_IP_STATUS_FLAG_INJECTED_ENDCHAIN | ADC_SAR_IP_STATUS_FLAG_CTU_EOC)) != 0U)
    {
        Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
    }
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }
}
#if defined(ADC_DMA_ERROR_SUPPORTED)
/**
* @brief          This function implements the dma Error notification for
*                 ADC Hardware Unit 0.
* @details        This function implements the dma Error notification for
*                 ADC Hardware Unit 0.
*
* @return         void
*
*/
void Adc_Ipw_Adc0DmaTransferError(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 0U;
    Adc_Ipw_DMATransferErrorHandler(PhysicalAdcUnit);
}
#endif /* ADC_DMA_ERROR_SUPPORTED*/
#endif /* (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_0_DMA_TRANSFER_USED)) */

/*==================================================================================================
                                          ADC HW UNIT 1
==================================================================================================*/
#if ((defined(ADC_UNIT_1_WDG_ISR_USED)) && (defined(ADC_WDG_SUPPORTED)))
/**
* @brief          This function implements the Wdg threshold notification for
*                 ADC Hardware Unit 1.
* @details        This function implements the Wdg threshold notification for
*                 ADC Hardware Unit 1.
*
* @return         void
*
*/
void Adc_Ipw_Adc1WdgThresholdNotification(const uint16 PhysicalChanId,
                                          const uint8 Flags)
{
    const Adc_HwUnitType PhysicalAdcUnit = 1U;

    Adc_Ipw_WdgThresholdNotification(PhysicalAdcUnit, (Adc_ChannelType)PhysicalChanId, Flags);
}
#endif /* ((defined(ADC_UNIT_1_WDG_ISR_USED)) && (defined(ADC_WDG_SUPPORTED))) */

#ifdef ADC_UNIT_1_NORMAL_ISR_USED
/**
* @brief          This function implements the end of normal chain notification for
*                 ADC Hardware Unit 1.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 1.
*
* @return         void
*
*/
void Adc_Ipw_Adc1EndNormalChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 1U;

    Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_1_NORMAL_ISR_USED */

