rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
#ifdef ADC_UNIT_3_NORMAL_ISR_USED
/**
* @brief          This function implements the end of normal chain notification for
*                 ADC Hardware Unit 3.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 3.
*
* @return         void
*
*/
void Adc_Ipw_Adc3EndNormalChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 3U;

    Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_3_NORMAL_ISR_USED */

#ifdef ADC_UNIT_3_INJECTED_ISR_USED
/**
* @brief          This function implements the end of injected chain notification for
*                 ADC Hardware Unit 3.
* @details        This function implements the end of injected chain notification for
*                 ADC Hardware Unit 3.
*
* @return         void
*
*/
void Adc_Ipw_Adc3EndInjectedChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 3U;

    Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_3_INJECTED_ISR_USED */

#if (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_3_DMA_TRANSFER_USED))
/**
* @brief          This function implements the end of dma transfer notification for
*                 ADC Hardware Unit 3.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 3.
*
* @return         void
*
*/
void Adc_Ipw_Adc3DmaTransferCompleteNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 3U;
    uint32 AdcStatusFlag;

    AdcStatusFlag = Adc_Sar_Ip_GetStatusFlags(PhysicalAdcUnit);

    if ((AdcStatusFlag & ADC_SAR_IP_STATUS_FLAG_NORMAL_ENDCHAIN) != 0U)
    {
        Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
    }
    else if ((AdcStatusFlag & (ADC_SAR_IP_STATUS_FLAG_INJECTED_ENDCHAIN | ADC_SAR_IP_STATUS_FLAG_CTU_EOC)) != 0U)
    {
        Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
    }
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }
}
#if defined(ADC_DMA_ERROR_SUPPORTED)
/**
* @brief          This function implements the dma Error notification for
*                 ADC Hardware Unit 3.
* @details        This function implements the dma Error notification for
*                 ADC Hardware Unit 3.
*
* @return         void
*
*/
void Adc_Ipw_Adc3DmaTransferError(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 3U;
    Adc_Ipw_DMATransferErrorHandler(PhysicalAdcUnit);
}
#endif /* ADC_DMA_ERROR_SUPPORTED*/
#endif /* (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_3_DMA_TRANSFER_USED)) */

/*==================================================================================================
                                          ADC HW UNIT 4
==================================================================================================*/
#if ((defined(ADC_UNIT_4_WDG_ISR_USED)) && (defined(ADC_WDG_SUPPORTED)))
/**
* @brief          This function implements the Wdg threshold notification for
*                 ADC Hardware Unit 4.
* @details        This function implements the Wdg threshold notification for
*                 ADC Hardware Unit 4.
*
* @return         void
*
*/
void Adc_Ipw_Adc4WdgThresholdNotification(const uint16 PhysicalChanId,
                                          const uint8 Flags)
{
    const Adc_HwUnitType PhysicalAdcUnit = 4U;

    Adc_Ipw_WdgThresholdNotification(PhysicalAdcUnit, (Adc_ChannelType)PhysicalChanId, Flags);
}
#endif /* ((defined(ADC_UNIT_4_WDG_ISR_USED)) && (defined(ADC_WDG_SUPPORTED))) */

#ifdef ADC_UNIT_4_NORMAL_ISR_USED
/**
* @brief          This function implements the end of normal chain notification for
*                 ADC Hardware Unit 4.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 4.
*
* @return         void
*
*/
void Adc_Ipw_Adc4EndNormalChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 4U;

    Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_4_NORMAL_ISR_USED */

#ifdef ADC_UNIT_4_INJECTED_ISR_USED
/**
* @brief          This function implements the end of injected chain notification for
*                 ADC Hardware Unit 4.
* @details        This function implements the end of injected chain notification for
*                 ADC Hardware Unit 4.
*
* @return         void
*
*/
void Adc_Ipw_Adc4EndInjectedChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 4U;

    Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_4_INJECTED_ISR_USED */

#if (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_4_DMA_TRANSFER_USED))
/**
* @brief          This function implements the end of dma transfer notification for
*                 ADC Hardware Unit 4.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 4.
*
* @return         void
*
*/
void Adc_Ipw_Adc4DmaTransferCompleteNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 4U;
    uint32 AdcStatusFlag;

    AdcStatusFlag = Adc_Sar_Ip_GetStatusFlags(PhysicalAdcUnit);

    if ((AdcStatusFlag & ADC_SAR_IP_STATUS_FLAG_NORMAL_ENDCHAIN) != 0U)
    {
        Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
    }
    else if ((AdcStatusFlag & (ADC_SAR_IP_STATUS_FLAG_INJECTED_ENDCHAIN | ADC_SAR_IP_STATUS_FLAG_CTU_EOC)) != 0U)
    {
        Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
    }
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }
}
#if defined(ADC_DMA_ERROR_SUPPORTED)
/**
* @brief          This function implements the dma Error notification for
*                 ADC Hardware Unit 4.
* @details        This function implements the dma Error notification for
*                 ADC Hardware Unit 4.
*
* @return         void
*
*/
void Adc_Ipw_Adc4DmaTransferError(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 4U;
    Adc_Ipw_DMATransferErrorHandler(PhysicalAdcUnit);
}
#endif /* ADC_DMA_ERROR_SUPPORTED*/
#endif /* (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_4_DMA_TRANSFER_USED)) */

/*==================================================================================================
                                          ADC HW UNIT 5
==================================================================================================*/
#if ((defined(ADC_UNIT_5_WDG_ISR_USED)) && (defined(ADC_WDG_SUPPORTED)))
/**
* @brief          This function implements the Wdg threshold notification for
*                 ADC Hardware Unit 5.
* @details        This function implements the Wdg threshold notification for
*                 ADC Hardware Unit 5.
*
* @return         void
*
*/
void Adc_Ipw_Adc5WdgThresholdNotification(const uint16 PhysicalChanId,
                                          const uint8 Flags)
{
    const Adc_HwUnitType PhysicalAdcUnit = 5U;

    Adc_Ipw_WdgThresholdNotification(PhysicalAdcUnit, (Adc_ChannelType)PhysicalChanId, Flags);
}
#endif /* ((defined(ADC_UNIT_5_WDG_ISR_USED)) && (defined(ADC_WDG_SUPPORTED))) */

