rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
#ifdef ADC_UNIT_5_NORMAL_ISR_USED
/**
* @brief          This function implements the end of normal chain notification for
*                 ADC Hardware Unit 5.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 5.
*
* @return         void
*
*/
void Adc_Ipw_Adc5EndNormalChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 5U;

    Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_5_NORMAL_ISR_USED */

#ifdef ADC_UNIT_5_INJECTED_ISR_USED
/**
* @brief          This function implements the end of injected chain notification for
*                 ADC Hardware Unit 5.
* @details        This function implements the end of injected chain notification for
*                 ADC Hardware Unit 5.
*
* @return         void
*
*/
void Adc_Ipw_Adc5EndInjectedChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 5U;

    Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_5_INJECTED_ISR_USED */

#if (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_5_DMA_TRANSFER_USED))
/**
* @brief          This function implements the end of dma transfer notification for
*                 ADC Hardware Unit 5.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 5.
*
* @return         void
*
*/
void Adc_Ipw_Adc5DmaTransferCompleteNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 5U;
    uint32 AdcStatusFlag;

    AdcStatusFlag = Adc_Sar_Ip_GetStatusFlags(PhysicalAdcUnit);

    if ((AdcStatusFlag & ADC_SAR_IP_STATUS_FLAG_NORMAL_ENDCHAIN) != 0U)
    {
        Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
    }
    else if ((AdcStatusFlag & (ADC_SAR_IP_STATUS_FLAG_INJECTED_ENDCHAIN | ADC_SAR_IP_STATUS_FLAG_CTU_EOC)) != 0U)
    {
        Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
    }
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }
}
#if defined(ADC_DMA_ERROR_SUPPORTED)
/**
* @brief          This function implements the dma Error notification for
*                 ADC Hardware Unit 5.
* @details        This function implements the dma Error notification for
*                 ADC Hardware Unit 5.
*
* @return         void
*
*/
void Adc_Ipw_Adc5DmaTransferError(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 5U;
    Adc_Ipw_DMATransferErrorHandler(PhysicalAdcUnit);
}
#endif /* ADC_DMA_ERROR_SUPPORTED*/
#endif /* (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_5_DMA_TRANSFER_USED)) */

/*==================================================================================================
                                          ADC HW UNIT 6
==================================================================================================*/
#if ((defined(ADC_UNIT_6_WDG_ISR_USED)) && (defined(ADC_WDG_SUPPORTED)))
/**
* @brief          This function implements the Wdg threshold notification for
*                 ADC Hardware Unit 6.
* @details        This function implements the Wdg threshold notification for
*                 ADC Hardware Unit 6.
*
* @return         void
*
*/
void Adc_Ipw_Adc6WdgThresholdNotification(const uint16 PhysicalChanId,
                                          const uint8 Flags)
{
    const Adc_HwUnitType PhysicalAdcUnit = 6U;

    Adc_Ipw_WdgThresholdNotification(PhysicalAdcUnit, (Adc_ChannelType)PhysicalChanId, Flags);
}
#endif /* ((defined(ADC_UNIT_6_WDG_ISR_USED)) && (defined(ADC_WDG_SUPPORTED))) */

#ifdef ADC_UNIT_6_NORMAL_ISR_USED
/**
* @brief          This function implements the end of normal chain notification for
*                 ADC Hardware Unit 6.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 6.
*
* @return         void
*
*/
void Adc_Ipw_Adc6EndNormalChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 6U;

    Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_6_NORMAL_ISR_USED */

#ifdef ADC_UNIT_6_INJECTED_ISR_USED
/**
* @brief          This function implements the end of injected chain notification for
*                 ADC Hardware Unit 6.
* @details        This function implements the end of injected chain notification for
*                 ADC Hardware Unit 6.
*
* @return         void
*
*/
void Adc_Ipw_Adc6EndInjectedChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 6U;

    Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_6_INJECTED_ISR_USED */

#if (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_6_DMA_TRANSFER_USED))
/**
* @brief          This function implements the end of dma transfer notification for
*                 ADC Hardware Unit 6.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 6.
*
* @return         void
*
*/
void Adc_Ipw_Adc6DmaTransferCompleteNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 6U;
    uint32 AdcStatusFlag;

    AdcStatusFlag = Adc_Sar_Ip_GetStatusFlags(PhysicalAdcUnit);

    if ((AdcStatusFlag & ADC_SAR_IP_STATUS_FLAG_NORMAL_ENDCHAIN) != 0U)
    {
        Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
    }
    else if ((AdcStatusFlag & (ADC_SAR_IP_STATUS_FLAG_INJECTED_ENDCHAIN | ADC_SAR_IP_STATUS_FLAG_CTU_EOC)) != 0U)
    {
        Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
    }
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }
}
#if defined(ADC_DMA_ERROR_SUPPORTED)
/**
* @brief          This function implements the dma Error notification for
*                 ADC Hardware Unit 6.
* @details        This function implements the dma Error notification for
*                 ADC Hardware Unit 6.
*
* @return         void
*
*/
void Adc_Ipw_Adc6DmaTransferError(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 6U;
    Adc_Ipw_DMATransferErrorHandler(PhysicalAdcUnit);
}
#endif /* ADC_DMA_ERROR_SUPPORTED*/
#endif /* (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_6_DMA_TRANSFER_USED)) */

/*==================================================================================================
                                          DMA Error Notification
==================================================================================================*/
#ifdef ADC_DMA_SUPPORTED
#if defined(ADC_DMA_ERROR_SUPPORTED)
/*FUNCTION**********************************************************************
 *
 * Function Name : Adc_Ipw_DMATransferErrorHandler
 * Description   : Handle error for DMA transfer. The main purpose of
 *                 this function is to create a function compatible with DMA
 *                 callback type
 *
 *END**************************************************************************/
static inline void Adc_Ipw_DMATransferErrorHandler(const Adc_HwUnitType PhysicalAdcUnit)
{
    Dma_Ip_LogicChannelStatusType DmaChannelStatus;
    const volatile uint8 UserId = Adc_GetUserID();
    Adc_HwUnitType LogicalAdcUnit = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.HwLogicalId[PhysicalAdcUnit];
    Adc_GroupType Group = Adc_axUnitStatus[LogicalAdcUnit].SwNormalQueue[0];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[Group]);
    Adc_HwUnitType LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    const uint32 AdcDmaLogicChId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[LogicalHwUnitId];
    uint32 TimeoutTicks = OsIf_MicrosToTicks(ADC_IPW_TIMEOUT_VAL, ADC_IPW_TIMEOUT_TYPE);
    uint32 CurrentTicks = OsIf_GetCounter(ADC_IPW_TIMEOUT_TYPE);
    uint32 ElapsedTicks = 0U;

