rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
    /* Prepare DMA status variables */
    DmaChannelStatus.Errors = 0UL;

    /* Get DMA channel status */
    while((0UL == DmaChannelStatus.Errors) && (ElapsedTicks < TimeoutTicks))
    {
        (void)Dma_Ip_GetLogicChannelStatus(AdcDmaLogicChId, &DmaChannelStatus);
        ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_IPW_TIMEOUT_TYPE);
    }
    /* Check for hardware errors */
    if (DmaChannelStatus.Errors != 0U)
    {
        if (GroupPtr->DmaErrorNotification != NULL_PTR)
        {
            /* Dma error notification*/
            GroupPtr->DmaErrorNotification();
        }
    }
}
#endif /* ADC_DMA_ERROR_SUPPORTED*/
#endif /*ADC_DMA_SUPPORTED*/

/*==================================================================================================
                                          BCTU UNIT 0 (0 and 1 for S32K396)
==================================================================================================*/
#if (ADC_HW_TRIGGER_API == STD_ON)
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
#ifdef ADC_UNIT_0_BCTU_LIST_ISR_USED

/**
* @brief          This function handles internal ADC updates after the BCTU list is complete, in Triggered Mode
* @details        The function is a notification to be called by BCTU IPL, corresponding to execution of the last conversion in a LIST of conversions for ADC0
*
* @return         void
*/
void Adc_Ipw_BctuEndListNotificationAdc0(void)
{
    const volatile uint8 UserId = Adc_GetUserID();
    const Adc_HwUnitType LogicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.HwLogicalId[0U];

    if (LogicalHwUnitId == ADC_IPW_INVALID_LOGICAL_UNIT_ID)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid user partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
        Adc_Ipw_EndHardwareConv(LogicalHwUnitId, TRUE, UserId);
    }
}
#endif /* ADC_UNIT_0_BCTU_LIST_ISR_USED */

#ifdef ADC_UNIT_1_BCTU_LIST_ISR_USED

/**
* @brief          This function handles internal ADC updates after the BCTU list is complete, in Triggered Mode
* @details        The function is a notification to be called by BCTU IPL, corresponding to execution of the last conversion in a LIST of conversions for ADC1
*
* @return         void
*/
void Adc_Ipw_BctuEndListNotificationAdc1(void)
{
    const volatile uint8 UserId = Adc_GetUserID();
    const Adc_HwUnitType LogicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.HwLogicalId[1U];

    if (LogicalHwUnitId == ADC_IPW_INVALID_LOGICAL_UNIT_ID)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid user partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
        Adc_Ipw_EndHardwareConv(LogicalHwUnitId, TRUE, UserId);
    }
}
#endif /* ADC_UNIT_1_BCTU_LIST_ISR_USED */

#ifdef ADC_UNIT_2_BCTU_LIST_ISR_USED

/**
* @brief          This function handles internal ADC updates after the BCTU list is complete, in Triggered Mode
* @details        The function is a notification to be called by BCTU IPL, corresponding to execution of the last conversion in a LIST of conversions for ADC2
*
* @return         void
*/
void Adc_Ipw_BctuEndListNotificationAdc2(void)
{
    const volatile uint8 UserId = Adc_GetUserID();
    const Adc_HwUnitType LogicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.HwLogicalId[2U];

    if (LogicalHwUnitId == ADC_IPW_INVALID_LOGICAL_UNIT_ID)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid user partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
        Adc_Ipw_EndHardwareConv(LogicalHwUnitId, TRUE, UserId);
    }
}
#endif /* ADC_UNIT_2_BCTU_LIST_ISR_USED */

#ifdef ADC_UNIT_3_BCTU_LIST_ISR_USED

/**
* @brief          This function handles internal ADC updates after the BCTU list is complete, in Triggered Mode
* @details        The function is a notification to be called by BCTU IPL, corresponding to execution of the last conversion in a LIST of conversions for ADC3
*
* @return         void
*/
void Adc_Ipw_BctuEndListNotificationAdc3(void)
{
    const volatile uint8 UserId = Adc_GetUserID();
    const Adc_HwUnitType LogicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.HwLogicalId[3U];

    if (LogicalHwUnitId == ADC_IPW_INVALID_LOGICAL_UNIT_ID)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid user partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
        Adc_Ipw_EndHardwareConv(LogicalHwUnitId, TRUE, UserId);
    }
}
#endif /* ADC_UNIT_3_BCTU_LIST_ISR_USED */

#ifdef ADC_UNIT_4_BCTU_LIST_ISR_USED

/**
* @brief          This function handles internal ADC updates after the BCTU list is complete, in Triggered Mode
* @details        The function is a notification to be called by BCTU IPL, corresponding to execution of the last conversion in a LIST of conversions for ADC4
*
* @return         void
*/
void Adc_Ipw_BctuEndListNotificationAdc4(void)
{
    const volatile uint8 UserId = Adc_GetUserID();
    const Adc_HwUnitType LogicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.HwLogicalId[4U];

    if (LogicalHwUnitId == ADC_IPW_INVALID_LOGICAL_UNIT_ID)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid user partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
        Adc_Ipw_EndHardwareConv(LogicalHwUnitId, TRUE, UserId);
    }
}
#endif /* ADC_UNIT_4_BCTU_LIST_ISR_USED */

