rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
#ifdef ADC_UNIT_5_BCTU_LIST_ISR_USED

/**
* @brief          This function handles internal ADC updates after the BCTU list is complete, in Triggered Mode
* @details        The function is a notification to be called by BCTU IPL, corresponding to execution of the last conversion in a LIST of conversions for ADC5
*
* @return         void
*/
void Adc_Ipw_BctuEndListNotificationAdc5(void)
{
    const volatile uint8 UserId = Adc_GetUserID();
    const Adc_HwUnitType LogicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.HwLogicalId[5U];

    if (LogicalHwUnitId == ADC_IPW_INVALID_LOGICAL_UNIT_ID)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid user partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
        Adc_Ipw_EndHardwareConv(LogicalHwUnitId, TRUE, UserId);
    }
}
#endif /* ADC_UNIT_5_BCTU_LIST_ISR_USED */

#ifdef ADC_UNIT_6_BCTU_LIST_ISR_USED

/**
* @brief          This function handles internal ADC updates after the BCTU list is complete, in Triggered Mode
* @details        The function is a notification to be called by BCTU IPL, corresponding to execution of the last conversion in a LIST of conversions for ADC6
*
* @return         void
*/
void Adc_Ipw_BctuEndListNotificationAdc6(void)
{
    const volatile uint8 UserId = Adc_GetUserID();
    const Adc_HwUnitType LogicalHwUnitId = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.HwLogicalId[6U];

    if (LogicalHwUnitId == ADC_IPW_INVALID_LOGICAL_UNIT_ID)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid user partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
        Adc_Ipw_EndHardwareConv(LogicalHwUnitId, TRUE, UserId);
    }
}
#endif /* ADC_UNIT_6_BCTU_LIST_ISR_USED */

#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */


/*==================================================================================================
                                          SDADC section
==================================================================================================*/

#if (STD_ON == ADC_IPW_SDADC_IS_USED)

#ifdef ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED

/**
* @brief     This function gets number of current samples that were converted in the group in DMA mode.
*
*/
static inline Adc_StreamNumSampleType Adc_Ipw_GetDmaTransferSamplesSdadc(const uint8 UserId,
                                                                         const Adc_GroupType Group,
                                                                         const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                                         const Adc_StreamNumSampleType GroupSamples)
{
    /* In normal DMA mode, only 1-sample was read per DMA request (NOTE: this can be improved by transfering upto the fifo threshold).
       In optimized DMA mode, the number of samples will be calculated from iteration value of the transferring DMA channel.
     */
    Adc_StreamNumSampleType TransferSamples = 1U;

#if ((ADC_ENABLE_LIMIT_CHECK == STD_ON) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS))
    const Adc_GroupType                GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr   = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    const Adc_HwUnitType          LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    const uint32                  AdcDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[LogicalHwUnitId];
#else
    /* Unused variables */
    (void)UserId;
    (void)Group;
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) || (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    const sint16 * const ReadBuffer = (sint16 *)( &(Adc_axGroupStatus[Group].ResultsBufferPtr[Adc_axGroupStatus[Group].ResultIndex]) );
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */

#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
#if (STD_ON == SDADC_IP_DSPSS_ENABLED)
    const uint32          AdcCountingDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcCountingDmaChanLogicId[LogicalHwUnitId];
#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */
    uint32                   TotalTransferSamples = 0U;  /* Total number of samples have been transferred so far */

    if (TRUE == GroupPtr->AdcOptimizeDmaStream)
    {
        /* Get current iter of the transferring DMA channel because Sdadc only supports 1 channel per group */
#if (STD_ON == SDADC_IP_DSPSS_ENABLED)
        if (NULL_PTR != AdcIpwConfigPtr->SdadcConfigPtrArr[LogicalHwUnitId]->DspssConfig)
        {
            (void)Dma_Ip_GetLogicChannelParam(AdcCountingDmaLogicChId, DMA_IP_CH_GET_CURRENT_ITER_COUNT, &TotalTransferSamples);
        }
        else
#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */
        {
            (void)Dma_Ip_GetLogicChannelParam(AdcDmaLogicChId, DMA_IP_CH_GET_CURRENT_ITER_COUNT, &TotalTransferSamples);
        }

        /* This condition only occurs at half interrupt
           When major loop completed, CITER roll back to be equal to GroupSamples, so no need to re-calculate
         */
        if (TotalTransferSamples != GroupSamples)
        {
            /* Recalculation is needed because CITER decreases its value from GroupSamples to 1 */
            TotalTransferSamples = (uint32)GroupSamples - TotalTransferSamples;
        }

        /* Calculate the number of samples transferred in the last DMA request */
        TransferSamples = (Adc_StreamNumSampleType)TotalTransferSamples - Adc_axGroupStatus[Group].ResultIndex;
    }
#else

    /* Unused variables */
    (void)AdcIpwConfigPtr;
    (void)GroupSamples;

#endif /* (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    if (TRUE == GroupPtr->AdcGroupLimitcheck)
    {
        if (FALSE == Adc_Ipw_CheckConversionValuesInRange((uint16)ReadBuffer[0U], LogicalHwUnitId, GroupPtr->AssignmentPtr[0U], UserId))
        {
            Adc_axGroupStatus[Group].LimitCheckFailed = TRUE;
            TransferSamples = 0U;
            if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
            {
                if (ADC_ACCESS_MODE_STREAMING == GroupPtr->AccessMode)
                {   /* Reset DMA destination address */
                    Adc_Ipw_ResetDmaDestinationAddress(LogicalHwUnitId, GroupPtr, AdcIpwConfigPtr, AdcDmaLogicChId, (uint32)(&ReadBuffer[0U]));
                }
                /* DMA Hardware Request was disabled after transfer completed, to avoid overwriting any new results before this gets processed. Re-enable DMA here. */
                (void)Dma_Ip_SetLogicChannelCommand(AdcDmaLogicChId, DMA_IP_CH_SET_HARDWARE_REQUEST);
            }
        }
    }
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */

    return TransferSamples;
}


static inline void Adc_Ipw_ResetDmaDestinationAddress(const Adc_HwUnitType LogicalHwUnitId,
                                                      const Adc_GroupConfigurationType * const GroupPtr,
                                                      const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                      const uint32 AdcDmaLogicChId,
                                                      const uint32 ResultsBufferrAddress)
{
    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[1U];
    boolean ResetRequired = FALSE;

