rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
    if ( (ADC_DMA == AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[LogicalHwUnitId]) &&
         ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
       )
    {
        ResetRequired = TRUE;
    }

#if (STD_ON == SDADC_IP_DSPSS_ENABLED)
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
    if ( (TRUE == GroupPtr->AdcOptimizeDmaStream) &&
         (NULL_PTR != AdcIpwConfigPtr->SdadcConfigPtrArr[LogicalHwUnitId]->DspssConfig)
       )
    {
        /* No needed for optimized DMA mode wit DSPSS enabled, because only one channel is continuously transferred into one element in the intermediate buffer */
        ResetRequired = FALSE;
    }
#endif /* ADC_OPTIMIZE_DMA_STREAMING_GROUPS = STD_ON */
#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */

    if (TRUE == ResetRequired)
    {
        /* Re-configure the DMA destination address to the beginning of Group's buffer */
        LocTransferList[0].Param = DMA_IP_CH_SET_DESTINATION_ADDRESS;
        LocTransferList[0].Value = ResultsBufferrAddress;
        (void)Dma_Ip_SetLogicChannelTransferList(AdcDmaLogicChId, LocTransferList, 1U);
    }

    /* Avoid compiler warning */
    (void)LogicalHwUnitId;
}


#if (STD_ON == SDADC_IP_DSPSS_ENABLED)

static inline void Adc_Ipw_ResetDmaSourceAddress(const Adc_HwUnitType LogicalHwUnitId,
                                                 const Adc_HwUnitType PhysicalHwUnitId,
                                                 const Adc_GroupConfigurationType * const GroupPtr,
                                                 const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                 const uint32 AdcDmaLogicChId)
{
    Dma_Ip_LogicChannelScatterGatherListType  LocTransferList[1U];

   if ( (NULL_PTR != AdcIpwConfigPtr->SdadcConfigPtrArr[LogicalHwUnitId]->DspssConfig)
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
       && (FALSE == GroupPtr->AdcOptimizeDmaStream)  /* No needed for optimized DMA mode, because it's reset automatically by "Adc_Ipw_SetupTcdLastSourceAddressOffset" */
#endif /* ADC_OPTIMIZE_DMA_STREAMING_GROUPS = STD_ON */
      )
   {
       /* Check and re-configure the DMA source address to the beginning of DSPSS's output buffer */
       if (TRUE == DSPSS_DmaReadBufferWrapPtrCheck((DSPSS_CFSDADC_DmaChannelType)PhysicalHwUnitId))
       {
           LocTransferList[0].Param = DMA_IP_CH_SET_SOURCE_ADDRESS;
           LocTransferList[0].Value = DSPSS_ThreadGetOutputBufferStart(PhysicalHwUnitId);
           (void)Dma_Ip_SetLogicChannelTransferList(AdcDmaLogicChId, LocTransferList, 1U);
       }
   }

#if (STD_OFF == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
    /* Avoid compiler warning */
    (void)GroupPtr;
#endif /* (STD_OFF == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */
}

#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */

#endif /* ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED */


#if ( defined(ADC_ANY_UNIT_FIFOFULL_ISR_USED) || defined(ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED) )

static inline void Adc_Ipw_UpdateGroupStateSdAdc(const uint8 UserId,
                                                 const Adc_HwUnitType Unit,
                                                 const Adc_GroupType Group,
                                                 const Adc_StreamNumSampleType GroupSamples,
                                                 const Adc_HwUnitType PhysicalHwUnitId)
{
    const Adc_GroupType                GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr   = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
    /* Get current sampling count */
    const Adc_StreamNumSampleType CurrentSampleCount = Adc_axGroupStatus[Group].ResultIndex;

#ifdef ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED
    const Adc_Ipw_Config                    * const AdcIpwConfigPtr = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr;
    const uint32                              AdcDmaLogicChId       = AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[Unit];
    const uint32                              ResultsBufferrAddress = (uint32)( &(Adc_axGroupStatus[Group].ResultsBufferPtr[0]) );
#endif /* ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED */

    /* At least once the group was converted */
    Adc_axGroupStatus[Group].AlreadyConverted = ADC_ALREADY_CONVERTED;

    if (ADC_BUSY == Adc_axGroupStatus[Group].Conversion)
    {
        /* SWS_Adc_00224 */
        Adc_axGroupStatus[Group].Conversion = ADC_COMPLETED;
    }

    /* If buffer is full of samples, wrap to 0 */
    if (GroupSamples <= CurrentSampleCount)
    {
        /* Change to stream complete according to AUTOSAR diagram (SWS_Adc_00325) */
        Adc_axGroupStatus[Group].Conversion = ADC_STREAM_COMPLETED;

        /* SWS_Adc_00519: For streaming linear groups:
           The ADC Driver stops the conversion as soon as the stream buffer is full (number of samples reached)
         */
        if ( (ADC_STREAM_BUFFER_LINEAR  == GroupPtr->BufferMode) &&
             (ADC_ACCESS_MODE_STREAMING == GroupPtr->AccessMode)
           )
        {
#if (ADC_HW_TRIGGER_API == STD_ON)
            if (ADC_TRIGG_SRC_HW == GroupPtr->TriggerSource)
            {
                /* Disable HW trigger */
                Sdadc_Ip_DisableHwTrigger(PhysicalHwUnitId);
                /* Remove the group from hardware queue */
                Adc_axUnitStatus[Unit].OngoingHwGroup = ADC_INVALID_HW_GROUP_ID;
            }
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

            /* Re-enable the SDADC */
            Adc_Ipw_UpdateGroupStateReenableSdAdc(PhysicalHwUnitId);
            /* Update queue and execute new start conversion request from queue if available */
            Adc_Ipw_UpdateQueue(Unit, UserId);
        }

        /* Wrap-around (regardless of the access mode) */
        Adc_axGroupStatus[Group].ResultIndex = 0U;

#ifdef ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED
        Adc_Ipw_ResetDmaDestinationAddress(Unit, GroupPtr, AdcIpwConfigPtr, AdcDmaLogicChId, ResultsBufferrAddress);
#endif /* ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED */
    }

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    /* Check user notification function and execute if available */
    if (TRUE == Adc_Ipw_CheckNotification(Group, UserId))
    {
        /* SWS_Adc_00140, SWS_Adc_00060 */
        GroupPtr->Notification();
    }
#endif /* ADC_GRP_NOTIF_CAPABILITY == STD_ON */

#ifdef ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED
    if ( (ADC_DMA == AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit]) &&
         ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
       )
    {
#if (STD_ON == SDADC_IP_DSPSS_ENABLED)
        /* Re-configure source address */
        Adc_Ipw_ResetDmaSourceAddress(Unit, PhysicalHwUnitId, GroupPtr, AdcIpwConfigPtr, AdcDmaLogicChId);
#endif /* (STD_ON == SDADC_IP_DSPSS_ENABLED) */

        /* Re-enable DMA Hardware request */
        Adc_Ipw_EnableDmaHwRequest(Unit, GroupPtr, AdcIpwConfigPtr);
    }
#endif /* ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED */
}

