rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
static inline void Adc_Ipw_UpdateGroupStateReenableSdAdc(const Adc_HwUnitType PhysicalHwUnitId)
{
    /* Stop the current conversion by disabling the SDADC */
    Sdadc_Ip_Powerdown(PhysicalHwUnitId);
    /* Disable fifo full request generation (for both interrupt and DMA) */
    Sdadc_Ip_DisableInterruptEvents(PhysicalHwUnitId, SDADC_IP_EVENT_FIFO_FULL);
    /* Re-enable the SDADC to be ready for the next conversion */
    Sdadc_Ip_Powerup(PhysicalHwUnitId);
}

static inline Adc_StreamNumSampleType Adc_Ipw_CalcAvailableSamplesSdAdc(const uint8 UserId,
                                                                        const Adc_HwUnitType Unit)
{
    Adc_StreamNumSampleType AvailableSamples;
    const Sdadc_Ip_ConfigType * const Config = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->SdadcConfigPtrArr[Unit];

#if (SDADC_IP_DSPSS_ENABLED == STD_ON)
    if (Config->DspssConfig != NULL_PTR)
    {
        /* Use DSPSS core buffer fifo output threshold value */
        AvailableSamples = (Adc_StreamNumSampleType)(Config->DspssConfig->OutputThreshold);
    }
    else
#endif
    {
        /* The number of available conversion results in SDADC hardware fifo (threshold plus 1) */
        AvailableSamples = (Adc_StreamNumSampleType)(Config->FifoThreshold) + 1U;

        /* The actual test shows that it can only read a maximum of 8 elements from the FIFO.
        For example: With threshold = 9, after 8 reads the fifo empty flag was set.
                     With threshold = 15, after 8 reads the fifo empty flag was set.
        */
        if (AvailableSamples > 8U)
        {
            AvailableSamples = 8U;
        }
    }

    return AvailableSamples;
}


static inline Adc_StreamNumSampleType Adc_Ipw_RecordResultSdAdc(const uint8 UserId,
                                                                const Adc_HwUnitType Unit,
                                                                const Adc_GroupType Group,
                                                                const Adc_StreamNumSampleType GroupSamples,
                                                                const Adc_HwUnitType PhysicalHwUnitId)
{
    /* Get current sampling count */
    const Adc_StreamNumSampleType CurrentSampleCount = Adc_axGroupStatus[Group].ResultIndex;
    /* Local variables to calculate the maximum samples can be read from fifo */
    Adc_StreamNumSampleType AvailableSamples;
    Adc_StreamNumSampleType ExpectedSamples;
    Adc_StreamNumSampleType ActualSamples = 0U;
    /* Current index in group buffer */
    sint16 * const ReadBuffer = (sint16 *)( &(Adc_axGroupStatus[Group].ResultsBufferPtr[CurrentSampleCount]) );

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    uint32 SampleCnt;
    sint16 ConvValue = 0;
    const Adc_GroupType              GroupIndex = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex]);
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */

    /* Calculate the number of available samples in fifo */
    AvailableSamples = Adc_Ipw_CalcAvailableSamplesSdAdc(UserId, Unit);

    /* Read upto fifo length or the remaining samples */
    ExpectedSamples = GroupSamples - CurrentSampleCount;
    if (ExpectedSamples > AvailableSamples)
    {
        ExpectedSamples = AvailableSamples;
    }

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    /* Checks if conversion values are in the configured range */
    if (TRUE == GroupPtr->AdcGroupLimitcheck)
    {
        /* Read each sample from FIFO and perform range checking one by one */
        for (SampleCnt = 0U; SampleCnt < ExpectedSamples; SampleCnt++)
        {
            if (1U == (Adc_StreamNumSampleType)Sdadc_Ip_GetConvData(PhysicalHwUnitId, 1U, &ConvValue))
            {
                if (TRUE == Adc_Ipw_CheckConversionValuesInRange((uint16)ConvValue, Unit, 0U, UserId))
                {
                    /* Result is is valid range, put it to buffer */
                    ReadBuffer[ActualSamples] = ConvValue;
                    ActualSamples++;
                }
            }
        }
        /* Check if all samples are valid*/
        if (ActualSamples != ExpectedSamples)
        {
            Adc_axGroupStatus[Group].AlreadyConverted = ADC_ALREADY_CONVERTED;
            Adc_axGroupStatus[Group].LimitCheckFailed = TRUE;
        }
    }
    else
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */
    {
        /* Get the converted results from hardware into group buffer */
        ActualSamples = (Adc_StreamNumSampleType)Sdadc_Ip_GetConvData(PhysicalHwUnitId, (uint32)ExpectedSamples, ReadBuffer);
    }
    
    /* Check if the requested read results are valid */
    if (ActualSamples != ExpectedSamples)
    {
        ActualSamples = 0U;  /* The converted data is invalid */
    }

    return ActualSamples;
}


static inline void Adc_Ipw_EndSoftwareConvSdAdc(const uint8 UserId,
                                                const Adc_HwUnitType Unit,
                                                const Adc_GroupType Group)
{
    /* Get the group to be converted */
    const Adc_GroupType           GroupIndex       = Adc_apxCfgPtr[UserId]->GroupIdToIndexMapPtr[Group];
    const Adc_StreamNumSampleType GroupSamples     = Adc_apxCfgPtr[UserId]->GroupsPtr[GroupIndex].NumSamples;
    const Adc_Ipw_Config * const  AdcIpwConfigPtr  = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr;
    const Adc_HwUnitType          PhysicalHwUnitId = AdcIpwConfigPtr->AdcPhysicalIdArr[Unit] - ADC_IPW_SDADC_PHYSICAL_ID_OFFSET;
    Adc_StreamNumSampleType       CompletedSamples;

#ifdef ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED
    if (ADC_DMA == AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
    {
        /* In DMA mode, the conversion result has been already transfered into buffer, only need to get the number of transferred samples */
        CompletedSamples = Adc_Ipw_GetDmaTransferSamplesSdadc(UserId, Group, AdcIpwConfigPtr, GroupSamples);
    }
    else
#endif /* ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED */
    {
        /* Get the conversion result and save to buffer */
        CompletedSamples = Adc_Ipw_RecordResultSdAdc(UserId, Unit, Group, GroupSamples, PhysicalHwUnitId);
    }

