rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
#if (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON)
    /* Call extra notification (if available) before updating registers (SWS_Adc_00060) */
    Adc_Ipw_CallExtraNotification(Group, UserId);
#endif /* (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON) */

    /* Check if the result is valid */
    if (0U != CompletedSamples)
    {
        /* Update the completed samples */
        Adc_axGroupStatus[Group].ResultIndex += CompletedSamples;

        /* Update group state and continue conversion */
        Adc_Ipw_UpdateGroupStateSdAdc(UserId, Unit, Group, GroupSamples, PhysicalHwUnitId);
    }
    else
    {
        /* Do nothing */
    }
}


static inline void Adc_Ipw_FifoFullNotification(const Adc_HwUnitType PhysicalAdcUnit)
{
    Adc_QueueIndexType SwNormalQueueIndex;
    /* Check that ADC unit is assigned to current user partition */
    const uint8 UserId = Adc_GetUserID();
    const Adc_HwUnitType LogicalAdcUnit = Adc_apxCfgPtr[UserId]->AdcIpwConfigPtr->Mapping.HwLogicalId[PhysicalAdcUnit];

    if (ADC_IPW_INVALID_LOGICAL_UNIT_ID == LogicalAdcUnit)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid user partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
        SwNormalQueueIndex = Adc_axUnitStatus[LogicalAdcUnit].SwNormalQueueIndex;
        /* Software queue is not empty and FIFO full event occurred */
        if (SwNormalQueueIndex > (Adc_QueueIndexType)0U)
        {
            /* Handle the end of conversion for the first group in queue */
            Adc_Ipw_EndSoftwareConvSdAdc(UserId, LogicalAdcUnit, Adc_axUnitStatus[LogicalAdcUnit].SwNormalQueue[0U]);
        }

#if (ADC_HW_TRIGGER_API == STD_ON)
        /* Hardware queue is not empty and FIFO full event occurred */
        if (ADC_INVALID_HW_GROUP_ID != Adc_axUnitStatus[LogicalAdcUnit].OngoingHwGroup)
        {
            /* Handle the end of conversion for the on going HW group (There is only one hardware group working at a time) */
            Adc_Ipw_EndSoftwareConvSdAdc(UserId, LogicalAdcUnit, Adc_axUnitStatus[LogicalAdcUnit].OngoingHwGroup);
        }
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
    }

}

#endif /* ADC_ANY_UNIT_FIFOFULL_ISR_USED || ADC_ANY_UNIT_SDADC_DMA_TRANSFER_USED */


/*==================================================================================================
                                          SDADC FIFO FULL NOTIFICATIONS
==================================================================================================*/

#ifdef ADC_UNIT_SDADC_0_FIFOFULL_ISR_USED
/**
* @brief          This function implements the fifo full notification for SDADC Hardware Unit 0.
* @return         void
*
*/
void Adc_Ipw_Sdadc0FifoFullNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 0U;

    Adc_Ipw_FifoFullNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_SDADC_0_FIFOFULL_ISR_USED */


#ifdef ADC_UNIT_SDADC_1_FIFOFULL_ISR_USED
/**
* @brief          This function implements the fifo full notification for SDADC Hardware Unit 1.
* @return         void
*
*/
void Adc_Ipw_Sdadc1FifoFullNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 1U;

    Adc_Ipw_FifoFullNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_SDADC_1_FIFOFULL_ISR_USED */


#ifdef ADC_UNIT_SDADC_2_FIFOFULL_ISR_USED
/**
* @brief          This function implements the fifo full notification for SDADC Hardware Unit 2.
* @return         void
*/
void Adc_Ipw_Sdadc2FifoFullNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 2U;

    Adc_Ipw_FifoFullNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_SDADC_2_FIFOFULL_ISR_USED */


#ifdef ADC_UNIT_SDADC_3_FIFOFULL_ISR_USED
/**
* @brief          This function implements the fifo full notification for SDADC Hardware Unit 3.
* @return         void
*/
void Adc_Ipw_Sdadc3FifoFullNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 3U;

    Adc_Ipw_FifoFullNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_SDADC_3_FIFOFULL_ISR_USED */


/*==================================================================================================
                                          SDADC DMA NOTIFICATIONS
==================================================================================================*/

#ifdef ADC_UNIT_SDADC_0_DMA_TRANSFER_USED
/**
* @brief          This function implements the end of dma transfer notification for SDADC Hardware Unit 0.
* @return         void
*
*/
void Adc_Ipw_Sdadc0DmaTransferCompleteNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 0U;

    Adc_Ipw_FifoFullNotification(PhysicalAdcUnit);
}

#if defined(ADC_DMA_ERROR_SUPPORTED)
/**
* @brief          This function implements the dma Error notification for
*                 ADC Hardware Unit 0.
* @details        This function implements the dma Error notification for
*                 ADC Hardware Unit 0.
*
* @return         void
*
*/
void Adc_Ipw_Sdadc0DmaTransferError(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 0U;
    Adc_Ipw_DMATransferErrorHandler(PhysicalAdcUnit);
}
#endif /* ADC_DMA_ERROR_SUPPORTED */
#endif /* ADC_UNIT_SDADC_0_DMA_TRANSFER_USED */


#ifdef ADC_UNIT_SDADC_1_DMA_TRANSFER_USED
/**
* @brief          This function implements the end of dma transfer notification for SDADC Hardware Unit 1.
* @return         void
*
*/
void Adc_Ipw_Sdadc1DmaTransferCompleteNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 1U;

    Adc_Ipw_FifoFullNotification(PhysicalAdcUnit);
}

#if defined(ADC_DMA_ERROR_SUPPORTED)
/**
* @brief          This function implements the dma Error notification for
*                 ADC Hardware Unit 1.
* @details        This function implements the dma Error notification for
*                 ADC Hardware Unit 1.
*
* @return         void
*
*/
void Adc_Ipw_Sdadc1DmaTransferError(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 1U;
    Adc_Ipw_DMATransferErrorHandler(PhysicalAdcUnit);
}
#endif /*ADC_DMA_ERROR_SUPPORTED*/
#endif /* ADC_UNIT_SDADC_1_DMA_TRANSFER_USED */


