rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Ipw_Irq.c
#ifdef ADC_UNIT_SDADC_2_DMA_TRANSFER_USED
/**
* @brief          This function implements the end of dma transfer notification for SDADC Hardware Unit 2.
* @return         void
*
*/
void Adc_Ipw_Sdadc2DmaTransferCompleteNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 2U;

    Adc_Ipw_FifoFullNotification(PhysicalAdcUnit);
}

#if defined(ADC_DMA_ERROR_SUPPORTED)
/**
* @brief          This function implements the dma Error notification for
*                 ADC Hardware Unit 2.
* @details        This function implements the dma Error notification for
*                 ADC Hardware Unit 2.
*
* @return         void
*
*/
void Adc_Ipw_Sdadc2DmaTransferError(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 2U;
    Adc_Ipw_DMATransferErrorHandler(PhysicalAdcUnit);
}
#endif /*ADC_DMA_ERROR_SUPPORTED*/
#endif /* ADC_UNIT_SDADC_2_DMA_TRANSFER_USED */


#ifdef ADC_UNIT_SDADC_3_DMA_TRANSFER_USED
/**
* @brief          This function implements the end of dma transfer notification for SDADC Hardware Unit 3.
* @return         void
*
*/
void Adc_Ipw_Sdadc3DmaTransferCompleteNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 3U;

    Adc_Ipw_FifoFullNotification(PhysicalAdcUnit);
}

#if defined(ADC_DMA_ERROR_SUPPORTED)
/**
* @brief          This function implements the dma Error notification for
*                 ADC Hardware Unit 3.
* @details        This function implements the dma Error notification for
*                 ADC Hardware Unit 3.
*
* @return         void
*
*/
void Adc_Ipw_Sdadc3DmaTransferError(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 3U;
    Adc_Ipw_DMATransferErrorHandler(PhysicalAdcUnit);
}
#endif /*ADC_DMA_ERROR_SUPPORTED*/
#endif /* ADC_UNIT_SDADC_3_DMA_TRANSFER_USED */


/*==================================================================================================
                                          SDADC WDG NOTIFICATIONS
==================================================================================================*/

#ifdef ADC_UNIT_SDADC_0_WDG_ISR_USED
/**
* @brief          This function implements the Wdg threshold notification for
*                 SDADC Hardware Unit 0.
* @return         void
*
*/
void Adc_Ipw_Sdadc0WdgThresholdNotification(const uint16 PhysicalChanId,
                                            const uint8 Flags)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 0U;

    Adc_Ipw_WdgThresholdNotification(PhysicalAdcUnit, (Adc_ChannelType)PhysicalChanId, Flags);
}
#endif /* ADC_UNIT_SDADC_0_WDG_ISR_USED */

#ifdef ADC_UNIT_SDADC_1_WDG_ISR_USED
/**
* @brief          This function implements the Wdg threshold notification for
*                 SDADC Hardware Unit 1.
* @return         void
*
*/
void Adc_Ipw_Sdadc1WdgThresholdNotification(const uint16 PhysicalChanId,
                                            const uint8 Flags)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 1U;

    Adc_Ipw_WdgThresholdNotification(PhysicalAdcUnit, (Adc_ChannelType)PhysicalChanId, Flags);
}
#endif /* ADC_UNIT_SDADC_1_WDG_ISR_USED */

#ifdef ADC_UNIT_SDADC_2_WDG_ISR_USED
/**
* @brief          This function implements the Wdg threshold notification for
*                 SDADC Hardware Unit 2.
* @return         void
*
*/
void Adc_Ipw_Sdadc2WdgThresholdNotification(const uint16 PhysicalChanId,
                                            const uint8 Flags)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 2U;

    Adc_Ipw_WdgThresholdNotification(PhysicalAdcUnit, (Adc_ChannelType)PhysicalChanId, Flags);
}
#endif /* ADC_UNIT_SDADC_2_WDG_ISR_USED */

#ifdef ADC_UNIT_SDADC_3_WDG_ISR_USED
/**
* @brief          This function implements the Wdg threshold notification for
*                 SDADC Hardware Unit 3.
* @return         void
*
*/
void Adc_Ipw_Sdadc3WdgThresholdNotification(const uint16 PhysicalChanId,
                                            const uint8 Flags)
{
    const Adc_HwUnitType PhysicalAdcUnit = ADC_IPW_SDADC_PHYSICAL_ID_OFFSET + 3U;

    Adc_Ipw_WdgThresholdNotification(PhysicalAdcUnit, (Adc_ChannelType)PhysicalChanId, Flags);
}
#endif /* ADC_UNIT_SDADC_3_WDG_ISR_USED */


#endif /* (STD_ON == ADC_IPW_SDADC_IS_USED) */

/*==================================================================================================
                                        End of SDADC section
==================================================================================================*/


#define ADC_STOP_SEC_CODE
#include "Adc_MemMap.h"

#ifdef __cplusplus
}
#endif

/** @} */
